openCSMP/openCSMP/lib/samg/samg3.h
//****************************************************************************************
// file: samg.h
// automatically created by tool make_amgparms_user
// created on (yyyy-mm-dd): 2014-11-20, time: 13:48
//****************************************************************************************

// INTERFACE TO FORTRAN90 SAMG3 : amg subroutines have
// to be called as SAMG3_SAMG when this interface is used
// author: Tanja Clees
// last modified: 2011/10/11 AK

////////////
/* Macros */
////////////

/* subroutine naming conventions.
for Unix / Linux: depending on the names of the Fortran symbols in libamg.a,
   choose one of the following macros via a -D option for the C++ compiler
   in your make.inc (as has already been done in the include files provided!):
      SAMG_LCASE
      SAMG_LCASE_USCORE   (see below what they do)
   if none of the above matches the naming conventions for your system,
   define appropriate macros yourself!
*/

/* SAMG_C_CALLCONV: macro (for Windows!) defining the standard calling convention.
   for Unix / Linux: set -DSAMG_UNIX_LINUX as an option for the C++ compiler
   in your make.inc (as has already been done in the include files provided!) */

/* Applications uses 8 Byte integers */
#ifdef INTEGER_SIZE_64
#ifdef _WIN32
#define APPL_INT __int64
#else
#define APPL_INT long int
#endif
#endif

/* default 4 Byte integer types */
#ifndef APPL_INT
#define APPL_INT int
#endif

#if SAMG_UNIX_LINUX
#define SAMG_C_CALLCONV void
#elif SAMG_CVF
// for Compaq Visual Fortran (tested with 6.6 X) :
#define SAMG_C_CALLCONV void __stdcall
#else
// for Intel Visual Fortran (tested with 8.X) :
#define SAMG_C_CALLCONV void __cdecl
#endif


/////////////////////////////////////
/* directives for subroutine names */
/////////////////////////////////////

#ifdef SAMG_LCASE
#define SAMG3 samg3
#define SAMG3_CTIME samg3_ctime
#define SAMG3_CPUTIME samg3_cputime
#define SAMG3_ELAPSED_TIME samg3_elapsed_time
#define SAMG3_ALL_ERRORINFO samg3_all_errorinfo
#define SAMG3_SIMPLE samg3_simple
#define SAMG3_MAIN samg3_main
#define SAMG3_LEAVE samg3_leave
#define SAMG3_REFRESH samg3_refresh
#define SAMG3_CLEANUP samg3_cleanup
#define SAMG3_RESET_HIDDEN samg3_reset_hidden
#define SAMG3_GET_COMPLEXITIES samg3_get_complexities
#define SAMG3_GET_NFLAG samg3_get_nflag
#define SAMG3_SET_NFLAG samg3_set_nflag
#define SAMG3_GET_NFLAGO samg3_get_nflago
#define SAMG3_SET_NFLAGO samg3_set_nflago
#define SAMG3_GET_NFLAGP samg3_get_nflagp
#define SAMG3_SET_NFLAGP samg3_set_nflagp
#define SAMG3_GET_NFLAGS samg3_get_nflags
#define SAMG3_SET_NFLAGS samg3_set_nflags
#define SAMG3_GET_LEVELS_CREATED samg3_get_levels_created
#define SAMG3_GET_LEVELS_USED samg3_get_levels_used
#define SAMG3_GET_LEV_SIZES samg3_get_lev_sizes
#define SAMG3_GET_MEM_ACTIVE samg3_get_mem_active
#define SAMG3_GET_TIME_AND_MEM samg3_get_time_and_mem
#define SAMG3_EXTRAPRINT samg3_extraprint
#define SAMG3_FLUSH samg3_flush
#define SAMG3_CVEC_ALLOC samg3_cvec_alloc
#define SAMG3_CVEC_DEALLOC samg3_cvec_dealloc
#define SAMG3_CVEC_SET samg3_cvec_set
#define SAMG3_CVEC_GET samg3_cvec_get
#define SAMG3_PROPOSE_NSYS_ISCALE_IU samg3_propose_nsys_iscale_iu
#define SAMG3_USED_OMP_THREADS samg3_used_omp_threads
#define SAMG3_GET_INNERMAX samg3_get_innermax
#define SAMG3_SET_INNERMAX samg3_set_innermax
#define SAMG3_DRV_SET_INNERMAX samg3_drv3_set_innermax
#define SAMG3_GET_NUM_SMOOTH_VECTORS samg3_get_num_smooth_vectors
#define SAMG3_SMOOTH_VECTOR_INIT samg3_smooth_vector_init
#define SAMG3_SMOOTH_VECTOR_SET samg3_smooth_vector_set
#define SAMG3_SMOOTH_VECTOR_GET samg3_smooth_vector_get
#define SAMG3_GET_NUM_DEFLATION_VECTORS samg3_get_num_deflation_vectors
#define SAMG3_DEFLATION_VECTOR_INIT samg3_deflation_vector_init
#define SAMG3_DEFLATION_VECTOR_SET samg3_deflation_vector_set
#define SAMG3_DEFLATION_VECTOR_GET samg3_deflation_vector_get
#define SAMG3_USER_CHECK samg3_user_check
#define SAMG3_USER_SOLVE samg3_user_solve
#define SAMG3_USER_CLEANUP samg3_user_cleanup
#define SAMG3_ARRAY_OFFSET samg3_array_offset
#define SAMG3_PERFINIT samg3_perfinit
#define SAMG3_PERFOUT samg3_perfout
#define SAMG3_PARALLEL_LIB samg3_parallel_lib
#define SAMG3_MEM_INFO samg3_mem_info
#define SAMG3_LRATIO samg3_lratio
#define SAMG3_ADDTIME samg3_addtime
#define SAMG3_COMPTIME samg3_comptime
#define SAMG3_COPY_GALERKIN samg3_copy_galerkin
#define SAMG3_OMEGA_JACOBI_ALLOC samg3_omega_jacobi_alloc
#define SAMG3_OMEGA_JACOBI_DEALLOC samg3_omega_jacobi_dealloc
#define SAMG3_OMEGA_JACOBI_SET samg3_omega_jacobi_set
#define SAMG3_CURRENT_RESIDUAL samg3_current_residual
#define SAMG3_OPEN_LOGFILE samg3_open_logfile
#define SAMG3_CLOSE_LOGFILE samg3_close_logfile
#define SAMG3_COO_VEC_SET samg3_coo_vec_set
#define SAMG3_COO_VEC_ALLOC samg3_coo_vec_alloc
#define SAMG3_COO_VEC_DEALLOC samg3_coo_vec_dealloc
#define SAMG3_IDEC samg3_idec
#define SAMG3_DC samg3_dc
#define XSAMG3 xsamg3
#define XSAMG3_DC xsamg3_dc
#define XSAMG3_START xsamg3_start
#define XSAMG3_START_LINUX xsamg3_start_linux
#define XSAMG3_USER_CTRL xsamg3_user_ctrl
#define XSAMG3_START_IUM xsamg3_start_ium
#define XSAMG3_START_SOLVER xsamg3_start_solver
#define XSAMG3_END_SOLVER xsamg3_end_solver
#define XSAMG3_FINALIZE xsamg3_finalize
#define XSAMG3_END xsamg3_end
#define XSAMG3_GET_LOGIO xsamg3_get_logio
#define XSAMG3_GET_SLAVE_RETURNCODE xsamg3_get_slave_returncode
#define XSAMG3_PROCESS_INFO xsamg3_process_info
#define XSAMG3_GET_INTERNAL_TIMER xsamg3_get_internal_timer
#define XSAMG3_MPI_INIT xsamg3_mpi_init
#define XSAMG3_MPI_FINALIZE xsamg3_mpi_finalize
#define XSAMG3_MPI_COMM_RANK xsamg3_mpi_comm_rank
#define XSAMG3_GET_MPI_COMM_WORLD xsamg3_get_mpi_comm_world
#define XSAMG3_GET_PARALLEL_RUN xsamg3_get_parallel_run
#define XSAMG3_IO_SETTINGS xsamg3_io_settings
#define XSAMG3_IO_SETTINGS2 xsamg3_io_settings2
#define XSAMG3_LAST_MSG xsamg3_last_msg
#define XSAMG3_READ_CONFIG xsamg3_read_config
#define XSAMG3_PRINT_INTERNAL_TIMER xsamg3_print_internal_timer
#define XSAMG3_ERROR_INFO xsamg3_error_info
#define XSAMG3_GET_IERR_ON_TAG_STOP xsamg3_get_ierr_on_tag_stop
#define XSAMG3_CONFIGFILE_MISSING xsamg3_configfile_missing
#define XSAMG3_LEAVE xsamg3_leave
#define XSAMG3_CLEANUP xsamg3_cleanup
#define SAMG3_DUMP_SEQUENCE_RESET samg3_dump_sequence_reset
#define SAMG3_GET_RESIDUAL_VECTOR_E samg3_get_residual_vector_e
#define SAMG3_GET_RESIDUAL_VECTOR_V samg3_get_residual_vector_v
#define SAMG3_RESIDUAL_VECTOR_LEAVE samg3_residual_vector_leave
#define SAMG3_SET_RESIDUAL_VECTOR_E samg3_set_residual_vector_e
#define SAMG3_SET_RESIDUAL_VECTOR_V samg3_set_residual_vector_v
#define SAMG3_SET_RESIDUAL_VECTOR_INIT samg3_set_residual_vector_init
#define XSAMG3_OIL xsamg3_oil
#define SAMG3_OIL samg3_oil
#define SAMG3_SET_RENUMBER_VEC samg3_set_renumber_vec
#define SAMG3_GET_RENUMBER_VEC samg3_get_renumber_vec
#define SAMG3_GETRE_NU samg3_getre_nu
#define SAMG3_GETDBLE_NU samg3_getdble_nu
#define SAMG3_GETINT_NU samg3_getint_nu
#define SAMG3_GETTE_NU samg3_gette_nu
#define SAMG3_GETLO_NU samg3_getlo_nu
#define SAMG3_GETSPEC_NU samg3_getspec_nu
#define SAMG3_SET_A_CMPLX_AGG_DEFAULT samg3_set_a_cmplx_agg_default
#define SAMG3_GET_A_CMPLX_AGG_DEFAULT samg3_get_a_cmplx_agg_default
#define SAMG3_SET_A_CMPLX_DEFAULT samg3_set_a_cmplx_default
#define SAMG3_GET_A_CMPLX_DEFAULT samg3_get_a_cmplx_default
#define SAMG3_SET_ALLOW_FILNAM_IN samg3_set_allow_filnam_in
#define SAMG3_GET_ALLOW_FILNAM_IN samg3_get_allow_filnam_in
#define SAMG3_SET_ALLOW_PRIVATE_IN samg3_set_allow_private_in
#define SAMG3_GET_ALLOW_PRIVATE_IN samg3_get_allow_private_in
#define SAMG3_SET_ALLOW_ELIM samg3_set_allow_elim
#define SAMG3_GET_ALLOW_ELIM samg3_get_allow_elim
#define SAMG3_SET_ALLUNS_AT_ALLPNTS samg3_set_alluns_at_allpnts
#define SAMG3_GET_ALLUNS_AT_ALLPNTS samg3_get_alluns_at_allpnts
#define SAMG3_SET_ART_TIME samg3_set_art_time
#define SAMG3_GET_ART_TIME samg3_get_art_time
#define SAMG3_SET_ART_TIME_CYC samg3_set_art_time_cyc
#define SAMG3_GET_ART_TIME_CYC samg3_get_art_time_cyc
#define SAMG3_SET_ART_TIME_CYC_2ND samg3_set_art_time_cyc_2nd
#define SAMG3_GET_ART_TIME_CYC_2ND samg3_get_art_time_cyc_2nd
#define SAMG3_SET_ART_TIME_SETUP samg3_set_art_time_setup
#define SAMG3_GET_ART_TIME_SETUP samg3_get_art_time_setup
#define SAMG3_SET_ART_TIME_SETUP_2ND samg3_set_art_time_setup_2nd
#define SAMG3_GET_ART_TIME_SETUP_2ND samg3_get_art_time_setup_2nd
#define SAMG3_SET_B_CMPLX samg3_set_b_cmplx
#define SAMG3_GET_B_CMPLX samg3_get_b_cmplx
#define SAMG3_SET_B_CMPLX_AGG_DEFAULT samg3_set_b_cmplx_agg_default
#define SAMG3_GET_B_CMPLX_AGG_DEFAULT samg3_get_b_cmplx_agg_default
#define SAMG3_SET_B_CMPLX_DEFAULT samg3_set_b_cmplx_default
#define SAMG3_GET_B_CMPLX_DEFAULT samg3_get_b_cmplx_default
#define SAMG3_SET_BACKUP samg3_set_backup
#define SAMG3_GET_BACKUP samg3_get_backup
#define SAMG3_SET_BLK_FILLEXP samg3_set_blk_fillexp
#define SAMG3_GET_BLK_FILLEXP samg3_get_blk_fillexp
#define SAMG3_SET_BLK_STAB samg3_set_blk_stab
#define SAMG3_GET_BLK_STAB samg3_get_blk_stab
#define SAMG3_SET_BLOCK_SCALE samg3_set_block_scale
#define SAMG3_GET_BLOCK_SCALE samg3_get_block_scale
#define SAMG3_SET_BLOCK_SCALE2 samg3_set_block_scale2
#define SAMG3_GET_BLOCK_SCALE2 samg3_get_block_scale2
#define SAMG3_SET_BLOCK_SCALE3 samg3_set_block_scale3
#define SAMG3_GET_BLOCK_SCALE3 samg3_get_block_scale3
#define SAMG3_SET_BS_AUTO_SIGN samg3_set_bs_auto_sign
#define SAMG3_GET_BS_AUTO_SIGN samg3_get_bs_auto_sign
#define SAMG3_SET_BS_MIN_BLOCK_SIZE samg3_set_bs_min_block_size
#define SAMG3_GET_BS_MIN_BLOCK_SIZE samg3_get_bs_min_block_size
#define SAMG3_SET_BS_OMP samg3_set_bs_omp
#define SAMG3_GET_BS_OMP samg3_get_bs_omp
#define SAMG3_ISET_BND_PARTITION_FILE samg3_iset_bnd_partition_file
#define SAMG3_IGET_BND_PARTITION_FILE samg3_iget_bnd_partition_file
#define SAMG3_SET_BND_PARTITION_FILE samg3_set_bnd_partition_file
#define SAMG3_GET_BND_PARTITION_FILE samg3_get_bnd_partition_file
#define SAMG3_SET_CHECK_ALLPNTS samg3_set_check_allpnts
#define SAMG3_GET_CHECK_ALLPNTS samg3_get_check_allpnts
#define SAMG3_SET_CHECK_ORDER samg3_set_check_order
#define SAMG3_GET_CHECK_ORDER samg3_get_check_order
#define SAMG3_SET_CHECK_BCSR_DUMP samg3_set_check_bcsr_dump
#define SAMG3_GET_CHECK_BCSR_DUMP samg3_get_check_bcsr_dump
#define SAMG3_SET_CL_CPL samg3_set_cl_cpl
#define SAMG3_GET_CL_CPL samg3_get_cl_cpl
#define SAMG3_SET_CL_ORDER samg3_set_cl_order
#define SAMG3_GET_CL_ORDER samg3_get_cl_order
#define SAMG3_SET_CL_OUTRES samg3_set_cl_outres
#define SAMG3_GET_CL_OUTRES samg3_get_cl_outres
#define SAMG3_SET_CL_LEVEL_DEP samg3_set_cl_level_dep
#define SAMG3_GET_CL_LEVEL_DEP samg3_get_cl_level_dep
#define SAMG3_SET_CL_AUTO_SIZE samg3_set_cl_auto_size
#define SAMG3_GET_CL_AUTO_SIZE samg3_get_cl_auto_size
#define SAMG3_SET_CL_PROC_BORDER samg3_set_cl_proc_border
#define SAMG3_GET_CL_PROC_BORDER samg3_get_cl_proc_border
#define SAMG3_SET_CL_QUALITY_MEASURE samg3_set_cl_quality_measure
#define SAMG3_GET_CL_QUALITY_MEASURE samg3_get_cl_quality_measure
#define SAMG3_SET_CL_GLOBAL_QUALITY samg3_set_cl_global_quality
#define SAMG3_GET_CL_GLOBAL_QUALITY samg3_get_cl_global_quality
#define SAMG3_SET_CL_OMP samg3_set_cl_omp
#define SAMG3_GET_CL_OMP samg3_get_cl_omp
#define SAMG3_SET_CL_CMK_REORDER samg3_set_cl_cmk_reorder
#define SAMG3_GET_CL_CMK_REORDER samg3_get_cl_cmk_reorder
#define SAMG3_SET_CLSOLVER_FINEST samg3_set_clsolver_finest
#define SAMG3_GET_CLSOLVER_FINEST samg3_get_clsolver_finest
#define SAMG3_SET_CLDENSE_CTRL samg3_set_cldense_ctrl
#define SAMG3_GET_CLDENSE_CTRL samg3_get_cldense_ctrl
#define SAMG3_SET_CONST_INT_GLK samg3_set_const_int_glk
#define SAMG3_GET_CONST_INT_GLK samg3_get_const_int_glk
#define SAMG3_SET_CONST_INT_SOL samg3_set_const_int_sol
#define SAMG3_GET_CONST_INT_SOL samg3_get_const_int_sol
#define SAMG3_SET_CNTRL_ENFORCE samg3_set_cntrl_enforce
#define SAMG3_GET_CNTRL_ENFORCE samg3_get_cntrl_enforce
#define SAMG3_SET_CNTRL_LOGFILE samg3_set_cntrl_logfile
#define SAMG3_GET_CNTRL_LOGFILE samg3_get_cntrl_logfile
#define SAMG3_SET_CNTRL_METHOD samg3_set_cntrl_method
#define SAMG3_GET_CNTRL_METHOD samg3_get_cntrl_method
#define SAMG3_SET_CNTRL_RELEASE samg3_set_cntrl_release
#define SAMG3_GET_CNTRL_RELEASE samg3_get_cntrl_release
#define SAMG3_SET_CNTRL_RES_DIFF samg3_set_cntrl_res_diff
#define SAMG3_GET_CNTRL_RES_DIFF samg3_get_cntrl_res_diff
#define SAMG3_SET_CNTRL_RETRY_ITER samg3_set_cntrl_retry_iter
#define SAMG3_GET_CNTRL_RETRY_ITER samg3_get_cntrl_retry_iter
#define SAMG3_SET_CNTRL_STEADY samg3_set_cntrl_steady
#define SAMG3_GET_CNTRL_STEADY samg3_get_cntrl_steady
#define SAMG3_SET_CONV_STOP samg3_set_conv_stop
#define SAMG3_GET_CONV_STOP samg3_get_conv_stop
#define SAMG3_SET_CORRECT_CLUSTER_INFO samg3_set_correct_cluster_info
#define SAMG3_GET_CORRECT_CLUSTER_INFO samg3_get_correct_cluster_info
#define SAMG3_SET_CSET_LASTPNT samg3_set_cset_lastpnt
#define SAMG3_GET_CSET_LASTPNT samg3_get_cset_lastpnt
#define SAMG3_SET_CSET_LESSVARS samg3_set_cset_lessvars
#define SAMG3_GET_CSET_LESSVARS samg3_get_cset_lessvars
#define SAMG3_SET_CSET_LONGROW samg3_set_cset_longrow
#define SAMG3_GET_CSET_LONGROW samg3_get_cset_longrow
#define SAMG3_ISET_CSET_READ samg3_iset_cset_read
#define SAMG3_IGET_CSET_READ samg3_iget_cset_read
#define SAMG3_SET_CSET_READ samg3_set_cset_read
#define SAMG3_GET_CSET_READ samg3_get_cset_read
#define SAMG3_SET_CSET_ZERODIAG samg3_set_cset_zerodiag
#define SAMG3_GET_CSET_ZERODIAG samg3_get_cset_zerodiag
#define SAMG3_SET_CSET_UNKNOWN samg3_set_cset_unknown
#define SAMG3_GET_CSET_UNKNOWN samg3_get_cset_unknown
#define SAMG3_SET_CSET_UNKNOWN1 samg3_set_cset_unknown1
#define SAMG3_GET_CSET_UNKNOWN1 samg3_get_cset_unknown1
#define SAMG3_SET_CSET_UNKNOWN2 samg3_set_cset_unknown2
#define SAMG3_GET_CSET_UNKNOWN2 samg3_get_cset_unknown2
#define SAMG3_SET_DELTA_MILU samg3_set_delta_milu
#define SAMG3_GET_DELTA_MILU samg3_get_delta_milu
#define SAMG3_SET_DENSX samg3_set_densx
#define SAMG3_GET_DENSX samg3_get_densx
#define SAMG3_SET_DIVERGENCE samg3_set_divergence
#define SAMG3_GET_DIVERGENCE samg3_get_divergence
#define SAMG3_SET_DIV_STOP_RULE samg3_set_div_stop_rule
#define SAMG3_GET_DIV_STOP_RULE samg3_get_div_stop_rule
#define SAMG3_SET_DIV_THRESHOLD samg3_set_div_threshold
#define SAMG3_GET_DIV_THRESHOLD samg3_get_div_threshold
#define SAMG3_SET_DROPTOL samg3_set_droptol
#define SAMG3_GET_DROPTOL samg3_get_droptol
#define SAMG3_SET_DROPTOL_CL samg3_set_droptol_cl
#define SAMG3_GET_DROPTOL_CL samg3_get_droptol_cl
#define SAMG3_SET_DROPTOL_2ND samg3_set_droptol_2nd
#define SAMG3_GET_DROPTOL_2ND samg3_get_droptol_2nd
#define SAMG3_SET_DROPTOL_SMO samg3_set_droptol_smo
#define SAMG3_GET_DROPTOL_SMO samg3_get_droptol_smo
#define SAMG3_SET_DUMP_APPROX_SOLUTION samg3_set_dump_approx_solution
#define SAMG3_GET_DUMP_APPROX_SOLUTION samg3_get_dump_approx_solution
#define SAMG3_SET_DUMP_CORRECTW samg3_set_dump_correctw
#define SAMG3_GET_DUMP_CORRECTW samg3_get_dump_correctw
#define SAMG3_SET_DUMP_GENERATED_SMOVEC samg3_set_dump_generated_smovec
#define SAMG3_GET_DUMP_GENERATED_SMOVEC samg3_get_dump_generated_smovec
#define SAMG3_SET_ECG samg3_set_ecg
#define SAMG3_GET_ECG samg3_get_ecg
#define SAMG3_SET_ECG_DEFAULT samg3_set_ecg_default
#define SAMG3_GET_ECG_DEFAULT samg3_get_ecg_default
#define SAMG3_SET_ICHOLESKY samg3_set_icholesky
#define SAMG3_GET_ICHOLESKY samg3_get_icholesky
#define SAMG3_SET_ENFORCE_FULLSMO samg3_set_enforce_fullsmo
#define SAMG3_GET_ENFORCE_FULLSMO samg3_get_enforce_fullsmo
#define SAMG3_SET_EPS_ABS samg3_set_eps_abs
#define SAMG3_GET_EPS_ABS samg3_get_eps_abs
#define SAMG3_SET_EPS_ACCEPT_JAC_UZAWA samg3_set_eps_accept_jac_uzawa
#define SAMG3_GET_EPS_ACCEPT_JAC_UZAWA samg3_get_eps_accept_jac_uzawa
#define SAMG3_SET_EPS_CONVERG_JAC_UZAWA samg3_set_eps_converg_jac_uzawa
#define SAMG3_GET_EPS_CONVERG_JAC_UZAWA samg3_get_eps_converg_jac_uzawa
#define SAMG3_SET_EPS_DD samg3_set_eps_dd
#define SAMG3_GET_EPS_DD samg3_get_eps_dd
#define SAMG3_SET_EPS_DIVERG_JAC_UZAWA samg3_set_eps_diverg_jac_uzawa
#define SAMG3_GET_EPS_DIVERG_JAC_UZAWA samg3_get_eps_diverg_jac_uzawa
#define SAMG3_SET_EPS_DIAG samg3_set_eps_diag
#define SAMG3_GET_EPS_DIAG samg3_get_eps_diag
#define SAMG3_SET_EPS_LSQ samg3_set_eps_lsq
#define SAMG3_GET_EPS_LSQ samg3_get_eps_lsq
#define SAMG3_SET_ETR samg3_set_etr
#define SAMG3_GET_ETR samg3_get_etr
#define SAMG3_SET_ETR_DEFAULT samg3_set_etr_default
#define SAMG3_GET_ETR_DEFAULT samg3_get_etr_default
#define SAMG3_SET_ETR2_SMO samg3_set_etr2_smo
#define SAMG3_GET_ETR2_SMO samg3_get_etr2_smo
#define SAMG3_SET_EWT samg3_set_ewt
#define SAMG3_GET_EWT samg3_get_ewt
#define SAMG3_SET_EWT_DEFAULT samg3_set_ewt_default
#define SAMG3_GET_EWT_DEFAULT samg3_get_ewt_default
#define SAMG3_SET_FACTOR_APP_VAR samg3_set_factor_app_var
#define SAMG3_GET_FACTOR_APP_VAR samg3_get_factor_app_var
#define SAMG3_SET_FACTOR_QUASI_RES samg3_set_factor_quasi_res
#define SAMG3_GET_FACTOR_QUASI_RES samg3_get_factor_quasi_res
#define SAMG3_SET_FACTOR_RES_VAR samg3_set_factor_res_var
#define SAMG3_GET_FACTOR_RES_VAR samg3_get_factor_res_var
#define SAMG3_SET_FACTOR_MATRIX_SCALE samg3_set_factor_matrix_scale
#define SAMG3_GET_FACTOR_MATRIX_SCALE samg3_get_factor_matrix_scale
#define SAMG3_SET_FACTOR_SOL_JAC_UZAWA samg3_set_factor_sol_jac_uzawa
#define SAMG3_GET_FACTOR_SOL_JAC_UZAWA samg3_get_factor_sol_jac_uzawa
#define SAMG3_ISET_FILNAM samg3_iset_filnam
#define SAMG3_IGET_FILNAM samg3_iget_filnam
#define SAMG3_SET_FILNAM samg3_set_filnam
#define SAMG3_GET_FILNAM samg3_get_filnam
#define SAMG3_ISET_FILNAM_DUMPSOL samg3_iset_filnam_dumpsol
#define SAMG3_IGET_FILNAM_DUMPSOL samg3_iget_filnam_dumpsol
#define SAMG3_SET_FILNAM_DUMPSOL samg3_set_filnam_dumpsol
#define SAMG3_GET_FILNAM_DUMPSOL samg3_get_filnam_dumpsol
#define SAMG3_ISET_FILNAM_DUMP samg3_iset_filnam_dump
#define SAMG3_IGET_FILNAM_DUMP samg3_iget_filnam_dump
#define SAMG3_SET_FILNAM_DUMP samg3_set_filnam_dump
#define SAMG3_GET_FILNAM_DUMP samg3_get_filnam_dump
#define SAMG3_ISET_FILNAM_UZAWA samg3_iset_filnam_uzawa
#define SAMG3_IGET_FILNAM_UZAWA samg3_iget_filnam_uzawa
#define SAMG3_SET_FILNAM_UZAWA samg3_set_filnam_uzawa
#define SAMG3_GET_FILNAM_UZAWA samg3_get_filnam_uzawa
#define SAMG3_SET_FLEX_PCG_LITE samg3_set_flex_pcg_lite
#define SAMG3_GET_FLEX_PCG_LITE samg3_get_flex_pcg_lite
#define SAMG3_SET_FORCE_ACCEL samg3_set_force_accel
#define SAMG3_GET_FORCE_ACCEL samg3_get_force_accel
#define SAMG3_SET_FORCE_ACCEL_2ND samg3_set_force_accel_2nd
#define SAMG3_GET_FORCE_ACCEL_2ND samg3_get_force_accel_2nd
#define SAMG3_SET_FULL_PIVOTING samg3_set_full_pivoting
#define SAMG3_GET_FULL_PIVOTING samg3_get_full_pivoting
#define SAMG3_SET_FULL_SETUP samg3_set_full_setup
#define SAMG3_GET_FULL_SETUP samg3_get_full_setup
#define SAMG3_SET_G_CMPLX_AGG_DEFAULT samg3_set_g_cmplx_agg_default
#define SAMG3_GET_G_CMPLX_AGG_DEFAULT samg3_get_g_cmplx_agg_default
#define SAMG3_SET_G_CMPLX_DEFAULT samg3_set_g_cmplx_default
#define SAMG3_GET_G_CMPLX_DEFAULT samg3_get_g_cmplx_default
#define SAMG3_SET_GALERKIN_TIMER samg3_set_galerkin_timer
#define SAMG3_GET_GALERKIN_TIMER samg3_get_galerkin_timer
#define SAMG3_SET_GLK_MULT_ZEROS samg3_set_glk_mult_zeros
#define SAMG3_GET_GLK_MULT_ZEROS samg3_get_glk_mult_zeros
#define SAMG3_SET_GMAX_MULTIPASS samg3_set_gmax_multipass
#define SAMG3_GET_GMAX_MULTIPASS samg3_get_gmax_multipass
#define SAMG3_SET_IAGGREGATION_PROFILE samg3_set_iaggregation_profile
#define SAMG3_GET_IAGGREGATION_PROFILE samg3_get_iaggregation_profile
#define SAMG3_SET_IAGGREGATION samg3_set_iaggregation
#define SAMG3_GET_IAGGREGATION samg3_get_iaggregation
#define SAMG3_SET_IALL_SMO samg3_set_iall_smo
#define SAMG3_GET_IALL_SMO samg3_get_iall_smo
#define SAMG3_SET_IAUTO_OMEGA_JACOBI samg3_set_iauto_omega_jacobi
#define SAMG3_GET_IAUTO_OMEGA_JACOBI samg3_get_iauto_omega_jacobi
#define SAMG3_SET_IAUTO_OMEGA_SMOAGG samg3_set_iauto_omega_smoagg
#define SAMG3_GET_IAUTO_OMEGA_SMOAGG samg3_get_iauto_omega_smoagg
#define SAMG3_SET_IAUTO_STOP samg3_set_iauto_stop
#define SAMG3_GET_IAUTO_STOP samg3_get_iauto_stop
#define SAMG3_SET_IDUMP_SEQUENCE_START samg3_set_idump_sequence_start
#define SAMG3_GET_IDUMP_SEQUENCE_START samg3_get_idump_sequence_start
#define SAMG3_SET_IDUMP_SEQUENCE_END samg3_set_idump_sequence_end
#define SAMG3_GET_IDUMP_SEQUENCE_END samg3_get_idump_sequence_end
#define SAMG3_SET_ISTAB_CG samg3_set_istab_cg
#define SAMG3_GET_ISTAB_CG samg3_get_istab_cg
#define SAMG3_SET_IELASTICITY_PROFILE samg3_set_ielasticity_profile
#define SAMG3_GET_IELASTICITY_PROFILE samg3_get_ielasticity_profile
#define SAMG3_SET_IELASTICITY samg3_set_ielasticity
#define SAMG3_GET_IELASTICITY samg3_get_ielasticity
#define SAMG3_SET_IESTIM_SPECT_RADIUS samg3_set_iestim_spect_radius
#define SAMG3_GET_IESTIM_SPECT_RADIUS samg3_get_iestim_spect_radius
#define SAMG3_SET_IESTIM_SMOOTH_NIT samg3_set_iestim_smooth_nit
#define SAMG3_GET_IESTIM_SMOOTH_NIT samg3_get_iestim_smooth_nit
#define SAMG3_SET_INIT_RES_TREATMENT samg3_set_init_res_treatment
#define SAMG3_GET_INIT_RES_TREATMENT samg3_get_init_res_treatment
#define SAMG3_SET_IPRNT_RES_ACCURACY samg3_set_iprnt_res_accuracy
#define SAMG3_GET_IPRNT_RES_ACCURACY samg3_get_iprnt_res_accuracy
#define SAMG3_SET_ISMO2DFL samg3_set_ismo2dfl
#define SAMG3_GET_ISMO2DFL samg3_get_ismo2dfl
#define SAMG3_SET_ISMOAGG_AGGRESSIVE samg3_set_ismoagg_aggressive
#define SAMG3_GET_ISMOAGG_AGGRESSIVE samg3_get_ismoagg_aggressive
#define SAMG3_SET_ISMOAGG_OVERCORRECTION samg3_set_ismoagg_overcorrection
#define SAMG3_GET_ISMOAGG_OVERCORRECTION samg3_get_ismoagg_overcorrection
#define SAMG3_SET_ISMOAGG_OPTIM samg3_set_ismoagg_optim
#define SAMG3_GET_ISMOAGG_OPTIM samg3_get_ismoagg_optim
#define SAMG3_SET_ISMOAGG_BLOCK_TYP samg3_set_ismoagg_block_typ
#define SAMG3_GET_ISMOAGG_BLOCK_TYP samg3_get_ismoagg_block_typ
#define SAMG3_SET_ISMOAGG_COMPRESSION samg3_set_ismoagg_compression
#define SAMG3_GET_ISMOAGG_COMPRESSION samg3_get_ismoagg_compression
#define SAMG3_SET_ISMOAGG_FILTER_TYP samg3_set_ismoagg_filter_typ
#define SAMG3_GET_ISMOAGG_FILTER_TYP samg3_get_ismoagg_filter_typ
#define SAMG3_SET_ISMOAGG_SMOOTH_TYP samg3_set_ismoagg_smooth_typ
#define SAMG3_GET_ISMOAGG_SMOOTH_TYP samg3_get_ismoagg_smooth_typ
#define SAMG3_SET_ISMOAGG_SMOOTH_NIT samg3_set_ismoagg_smooth_nit
#define SAMG3_GET_ISMOAGG_SMOOTH_NIT samg3_get_ismoagg_smooth_nit
#define SAMG3_SET_ISMOAGG_SMOOTH_1LEV samg3_set_ismoagg_smooth_1lev
#define SAMG3_GET_ISMOAGG_SMOOTH_1LEV samg3_get_ismoagg_smooth_1lev
#define SAMG3_SET_ISMOAGG_SMOOTH_NLEV samg3_set_ismoagg_smooth_nlev
#define SAMG3_GET_ISMOAGG_SMOOTH_NLEV samg3_get_ismoagg_smooth_nlev
#define SAMG3_SET_IB_CMPLX samg3_set_ib_cmplx
#define SAMG3_GET_IB_CMPLX samg3_get_ib_cmplx
#define SAMG3_SET_IB_CMPLX_AGG_DEFAULT samg3_set_ib_cmplx_agg_default
#define SAMG3_GET_IB_CMPLX_AGG_DEFAULT samg3_get_ib_cmplx_agg_default
#define SAMG3_SET_IB_CMPLX_DEFAULT samg3_set_ib_cmplx_default
#define SAMG3_GET_IB_CMPLX_DEFAULT samg3_get_ib_cmplx_default
#define SAMG3_SET_IBGS_PIVOT samg3_set_ibgs_pivot
#define SAMG3_GET_IBGS_PIVOT samg3_get_ibgs_pivot
#define SAMG3_SET_ICASE_JAC_UZAWA samg3_set_icase_jac_uzawa
#define SAMG3_GET_ICASE_JAC_UZAWA samg3_get_icase_jac_uzawa
#define SAMG3_SET_ISTATISTICS_SMOVEC samg3_set_istatistics_smovec
#define SAMG3_GET_ISTATISTICS_SMOVEC samg3_get_istatistics_smovec
#define SAMG3_SET_ICHECK_SMOINT samg3_set_icheck_smoint
#define SAMG3_GET_ICHECK_SMOINT samg3_get_icheck_smoint
#define SAMG3_SET_ICOLOR_OMP samg3_set_icolor_omp
#define SAMG3_GET_ICOLOR_OMP samg3_get_icolor_omp
#define SAMG3_SET_IORDERED_OMP samg3_set_iordered_omp
#define SAMG3_GET_IORDERED_OMP samg3_get_iordered_omp
#define SAMG3_SET_ICRITS samg3_set_icrits
#define SAMG3_GET_ICRITS samg3_get_icrits
#define SAMG3_SET_IDTEST_UZAWA samg3_set_idtest_uzawa
#define SAMG3_GET_IDTEST_UZAWA samg3_get_idtest_uzawa
#define SAMG3_SET_IHUGE samg3_set_ihuge
#define SAMG3_GET_IHUGE samg3_get_ihuge
#define SAMG3_SET_IJAC_UZAWA samg3_set_ijac_uzawa
#define SAMG3_GET_IJAC_UZAWA samg3_get_ijac_uzawa
#define SAMG3_SET_ILU4ALLSCHWARZ samg3_set_ilu4allschwarz
