openCSMP/openCSMP/lib/samg/samg3.h
#define SAMG3_GET_ILU4ALLSCHWARZ samg3_get_ilu4allschwarz
#define SAMG3_SET_ILU_SPEED samg3_set_ilu_speed
#define SAMG3_GET_ILU_SPEED samg3_get_ilu_speed
#define SAMG3_SET_IMPLDO_READ_WRITE_LEN samg3_set_impldo_read_write_len
#define SAMG3_GET_IMPLDO_READ_WRITE_LEN samg3_get_impldo_read_write_len
#define SAMG3_SET_INFO_KEEPMEM samg3_set_info_keepmem
#define SAMG3_GET_INFO_KEEPMEM samg3_get_info_keepmem
#define SAMG3_SET_INNER_ACCEL samg3_set_inner_accel
#define SAMG3_GET_INNER_ACCEL samg3_get_inner_accel
#define SAMG3_SET_IODUMP samg3_set_iodump
#define SAMG3_GET_IODUMP samg3_get_iodump
#define SAMG3_ISET_IOFILE_OPTA samg3_iset_iofile_opta
#define SAMG3_IGET_IOFILE_OPTA samg3_iget_iofile_opta
#define SAMG3_SET_IOFILE_OPTA samg3_set_iofile_opta
#define SAMG3_GET_IOFILE_OPTA samg3_get_iofile_opta
#define SAMG3_ISET_IOFORM samg3_iset_ioform
#define SAMG3_IGET_IOFORM samg3_iget_ioform
#define SAMG3_SET_IOFORM samg3_set_ioform
#define SAMG3_GET_IOFORM samg3_get_ioform
#define SAMG3_SET_IOGRID samg3_set_iogrid
#define SAMG3_GET_IOGRID samg3_get_iogrid
#define SAMG3_SET_IOMOVIE samg3_set_iomovie
#define SAMG3_GET_IOMOVIE samg3_get_iomovie
#define SAMG3_SET_IOSCRATCH_DEFAULT samg3_set_ioscratch_default
#define SAMG3_GET_IOSCRATCH_DEFAULT samg3_get_ioscratch_default
#define SAMG3_SET_IOUNIT_OPTA samg3_set_iounit_opta
#define SAMG3_GET_IOUNIT_OPTA samg3_get_iounit_opta
#define SAMG3_SET_IPASS_MAX_SET samg3_set_ipass_max_set
#define SAMG3_GET_IPASS_MAX_SET samg3_get_ipass_max_set
#define SAMG3_SET_IRESTRICTION_OPENMP samg3_set_irestriction_openmp
#define SAMG3_GET_IRESTRICTION_OPENMP samg3_get_irestriction_openmp
#define SAMG3_SET_IPRESSURE_UZAWA samg3_set_ipressure_uzawa
#define SAMG3_GET_IPRESSURE_UZAWA samg3_get_ipressure_uzawa
#define SAMG3_SET_IPROFILE_GEOMETRIC samg3_set_iprofile_geometric
#define SAMG3_GET_IPROFILE_GEOMETRIC samg3_get_iprofile_geometric
#define SAMG3_SET_ISAT_UZAWA samg3_set_isat_uzawa
#define SAMG3_GET_ISAT_UZAWA samg3_get_isat_uzawa
#define SAMG3_SET_ISET_VIO_DD samg3_set_iset_vio_dd
#define SAMG3_GET_ISET_VIO_DD samg3_get_iset_vio_dd
#define SAMG3_SET_ISSTEP_UZAWA samg3_set_isstep_uzawa
#define SAMG3_GET_ISSTEP_UZAWA samg3_get_isstep_uzawa
#define SAMG3_SET_ISTEP1CASE_UZAWA samg3_set_istep1case_uzawa
#define SAMG3_GET_ISTEP1CASE_UZAWA samg3_get_istep1case_uzawa
#define SAMG3_SET_ISTEERING samg3_set_isteering
#define SAMG3_GET_ISTEERING samg3_get_isteering
#define SAMG3_SET_ISWIT3_USER samg3_set_iswit3_user
#define SAMG3_GET_ISWIT3_USER samg3_get_iswit3_user
#define SAMG3_SET_ITER_CHECK samg3_set_iter_check
#define SAMG3_GET_ITER_CHECK samg3_get_iter_check
#define SAMG3_SET_ITER_MATRIX_SCALE samg3_set_iter_matrix_scale
#define SAMG3_GET_ITER_MATRIX_SCALE samg3_get_iter_matrix_scale
#define SAMG3_SET_ITER_PRE samg3_set_iter_pre
#define SAMG3_GET_ITER_PRE samg3_get_iter_pre
#define SAMG3_SET_ITMAX_CONV samg3_set_itmax_conv
#define SAMG3_GET_ITMAX_CONV samg3_get_itmax_conv
#define SAMG3_SET_ITRACE_AMGMAIN samg3_set_itrace_amgmain
#define SAMG3_GET_ITRACE_AMGMAIN samg3_get_itrace_amgmain
#define SAMG3_SET_ITRACELEVEL samg3_set_itracelevel
#define SAMG3_GET_ITRACELEVEL samg3_get_itracelevel
#define SAMG3_SET_ITRACE_CLSOL samg3_set_itrace_clsol
#define SAMG3_GET_ITRACE_CLSOL samg3_get_itrace_clsol
#define SAMG3_SET_ITRACE_CLDENSE samg3_set_itrace_cldense
#define SAMG3_GET_ITRACE_CLDENSE samg3_get_itrace_cldense
#define SAMG3_SET_ITRACE_DIVSTOP samg3_set_itrace_divstop
#define SAMG3_GET_ITRACE_DIVSTOP samg3_get_itrace_divstop
#define SAMG3_SET_ITRACE_JAC_UZAWA samg3_set_itrace_jac_uzawa
#define SAMG3_GET_ITRACE_JAC_UZAWA samg3_get_itrace_jac_uzawa
#define SAMG3_SET_ITRACE_MK_REGULAR samg3_set_itrace_mk_regular
#define SAMG3_GET_ITRACE_MK_REGULAR samg3_get_itrace_mk_regular
#define SAMG3_SET_ITRACE_MATRIX_MODE samg3_set_itrace_matrix_mode
#define SAMG3_GET_ITRACE_MATRIX_MODE samg3_get_itrace_matrix_mode
#define SAMG3_SET_ITRACE_MATRIX_STORAGE samg3_set_itrace_matrix_storage
#define SAMG3_GET_ITRACE_MATRIX_STORAGE samg3_get_itrace_matrix_storage
#define SAMG3_SET_ITRACE_SCHWARZ samg3_set_itrace_schwarz
#define SAMG3_GET_ITRACE_SCHWARZ samg3_get_itrace_schwarz
#define SAMG3_SET_ITRACE_SMO samg3_set_itrace_smo
#define SAMG3_GET_ITRACE_SMO samg3_get_itrace_smo
#define SAMG3_SET_ITRACE_SOL samg3_set_itrace_sol
#define SAMG3_GET_ITRACE_SOL samg3_get_itrace_sol
#define SAMG3_SET_ITRACE_SPLIT samg3_set_itrace_split
#define SAMG3_GET_ITRACE_SPLIT samg3_get_itrace_split
#define SAMG3_SET_ITRACE_UZAWA samg3_set_itrace_uzawa
#define SAMG3_GET_ITRACE_UZAWA samg3_get_itrace_uzawa
#define SAMG3_SET_SMOAGG_NOQR samg3_set_smoagg_noqr
#define SAMG3_GET_SMOAGG_NOQR samg3_get_smoagg_noqr
#define SAMG3_SET_STACKTRACE samg3_set_stacktrace
#define SAMG3_GET_STACKTRACE samg3_get_stacktrace
#define SAMG3_SET_STORE_PGS_FACTOR samg3_set_store_pgs_factor
#define SAMG3_GET_STORE_PGS_FACTOR samg3_get_store_pgs_factor
#define SAMG3_SET_KCYCLE_PROFILE samg3_set_kcycle_profile
#define SAMG3_GET_KCYCLE_PROFILE samg3_get_kcycle_profile
#define SAMG3_SET_KEEPMEM samg3_set_keepmem
#define SAMG3_GET_KEEPMEM samg3_get_keepmem
#define SAMG3_SET_K_DISABLE_KRYLOV1 samg3_set_k_disable_krylov1
#define SAMG3_GET_K_DISABLE_KRYLOV1 samg3_get_k_disable_krylov1
#define SAMG3_SET_K_DYNCYC samg3_set_k_dyncyc
#define SAMG3_GET_K_DYNCYC samg3_get_k_dyncyc
#define SAMG3_SET_LASTGRID samg3_set_lastgrid
#define SAMG3_GET_LASTGRID samg3_get_lastgrid
#define SAMG3_SET_LEV_COARSENING_TOO_SLOW samg3_set_lev_coarsening_too_slow
#define SAMG3_GET_LEV_COARSENING_TOO_SLOW samg3_get_lev_coarsening_too_slow
#define SAMG3_SET_LEVELS_UZAWA samg3_set_levels_uzawa
#define SAMG3_GET_LEVELS_UZAWA samg3_get_levels_uzawa
#define SAMG3_SET_LEVELX samg3_set_levelx
#define SAMG3_GET_LEVELX samg3_get_levelx
#define SAMG3_SET_LEVELX_2ND samg3_set_levelx_2nd
#define SAMG3_GET_LEVELX_2ND samg3_get_levelx_2nd
#define SAMG3_SET_LFIL_CL samg3_set_lfil_cl
#define SAMG3_GET_LFIL_CL samg3_get_lfil_cl
#define SAMG3_SET_LFIL_2ND samg3_set_lfil_2nd
#define SAMG3_GET_LFIL_2ND samg3_get_lfil_2nd
#define SAMG3_SET_LFIL_SMO samg3_set_lfil_smo
#define SAMG3_GET_LFIL_SMO samg3_get_lfil_smo
#define SAMG3_ISET_LOGFILE samg3_iset_logfile
#define SAMG3_IGET_LOGFILE samg3_iget_logfile
#define SAMG3_SET_LOGFILE samg3_set_logfile
#define SAMG3_GET_LOGFILE samg3_get_logfile
#define SAMG3_SET_LOGIO samg3_set_logio
#define SAMG3_GET_LOGIO samg3_get_logio
#define SAMG3_SET_LU_REUSE samg3_set_lu_reuse
#define SAMG3_GET_LU_REUSE samg3_get_lu_reuse
#define SAMG3_SET_MATRIX_MODE samg3_set_matrix_mode
#define SAMG3_GET_MATRIX_MODE samg3_get_matrix_mode
#define SAMG3_SET_MATRIX_FORMAT samg3_set_matrix_format
#define SAMG3_GET_MATRIX_FORMAT samg3_get_matrix_format
#define SAMG3_SET_MATRIX_SCALE_RENORM samg3_set_matrix_scale_renorm
#define SAMG3_GET_MATRIX_SCALE_RENORM samg3_get_matrix_scale_renorm
#define SAMG3_SET_MAX_CALLS samg3_set_max_calls
#define SAMG3_GET_MAX_CALLS samg3_get_max_calls
#define SAMG3_SET_MAX_CL_SIZE samg3_set_max_cl_size
#define SAMG3_GET_MAX_CL_SIZE samg3_get_max_cl_size
#define SAMG3_SET_MAXCORR_CLUSTER samg3_set_maxcorr_cluster
#define SAMG3_GET_MAXCORR_CLUSTER samg3_get_maxcorr_cluster
#define SAMG3_SET_MAX_LEVEL samg3_set_max_level
#define SAMG3_GET_MAX_LEVEL samg3_get_max_level
#define SAMG3_SET_MAX_NB_LIST_SIZE samg3_set_max_nb_list_size
#define SAMG3_GET_MAX_NB_LIST_SIZE samg3_get_max_nb_list_size
#define SAMG3_SET_MAXITER_JAC_UZAWA samg3_set_maxiter_jac_uzawa
#define SAMG3_GET_MAXITER_JAC_UZAWA samg3_get_maxiter_jac_uzawa
#define SAMG3_SET_MAXOP_RESTART samg3_set_maxop_restart
#define SAMG3_GET_MAXOP_RESTART samg3_get_maxop_restart
#define SAMG3_SET_MAXRETRY_JAC_UZAWA samg3_set_maxretry_jac_uzawa
#define SAMG3_GET_MAXRETRY_JAC_UZAWA samg3_get_maxretry_jac_uzawa
#define SAMG3_SET_MILU samg3_set_milu
#define SAMG3_GET_MILU samg3_get_milu
#define SAMG3_SET_MIN_CL_SIZE samg3_set_min_cl_size
#define SAMG3_GET_MIN_CL_SIZE samg3_get_min_cl_size
#define SAMG3_SET_MIN_MULTI_SIZE samg3_set_min_multi_size
#define SAMG3_GET_MIN_MULTI_SIZE samg3_get_min_multi_size
#define SAMG3_SET_MINITER_JAC_UZAWA samg3_set_miniter_jac_uzawa
#define SAMG3_GET_MINITER_JAC_UZAWA samg3_get_miniter_jac_uzawa
#define SAMG3_SET_MK_REGULAR samg3_set_mk_regular
#define SAMG3_GET_MK_REGULAR samg3_get_mk_regular
#define SAMG3_SET_MODE_CNTRL samg3_set_mode_cntrl
#define SAMG3_GET_MODE_CNTRL samg3_get_mode_cntrl
#define SAMG3_SET_MODE_DEBUG samg3_set_mode_debug
#define SAMG3_GET_MODE_DEBUG samg3_get_mode_debug
#define SAMG3_SET_MODE_MESS samg3_set_mode_mess
#define SAMG3_GET_MODE_MESS samg3_get_mode_mess
#define SAMG3_SET_MODIFY_MAT samg3_set_modify_mat
#define SAMG3_GET_MODIFY_MAT samg3_get_modify_mat
#define SAMG3_SET_MODIFY_RESTRICTION samg3_set_modify_restriction
#define SAMG3_GET_MODIFY_RESTRICTION samg3_get_modify_restriction
#define SAMG3_SET_MULTIPASS_ALLCOUP samg3_set_multipass_allcoup
#define SAMG3_GET_MULTIPASS_ALLCOUP samg3_get_multipass_allcoup
#define SAMG3_SET_NBLK_DEBUG samg3_set_nblk_debug
#define SAMG3_GET_NBLK_DEBUG samg3_get_nblk_debug
#define SAMG3_SET_NBLK_MAX samg3_set_nblk_max
#define SAMG3_GET_NBLK_MAX samg3_get_nblk_max
#define SAMG3_SET_NBLK_OVERLAP samg3_set_nblk_overlap
#define SAMG3_GET_NBLK_OVERLAP samg3_get_nblk_overlap
#define SAMG3_SET_NBLK_RESID samg3_set_nblk_resid
#define SAMG3_GET_NBLK_RESID samg3_get_nblk_resid
#define SAMG3_SET_NBLK_SOLVE samg3_set_nblk_solve
#define SAMG3_GET_NBLK_SOLVE samg3_get_nblk_solve
#define SAMG3_SET_NBLK_SOLVER samg3_set_nblk_solver
#define SAMG3_GET_NBLK_SOLVER samg3_get_nblk_solver
#define SAMG3_SET_NBND_OMEGA samg3_set_nbnd_omega
#define SAMG3_GET_NBND_OMEGA samg3_get_nbnd_omega
#define SAMG3_SET_NBND_OMEGA_UZAWA samg3_set_nbnd_omega_uzawa
#define SAMG3_GET_NBND_OMEGA_UZAWA samg3_get_nbnd_omega_uzawa
#define SAMG3_SET_NBND_SWEEPS samg3_set_nbnd_sweeps
#define SAMG3_GET_NBND_SWEEPS samg3_get_nbnd_sweeps
#define SAMG3_SET_NBND_SWEEPS_UZAWA samg3_set_nbnd_sweeps_uzawa
#define SAMG3_GET_NBND_SWEEPS_UZAWA samg3_get_nbnd_sweeps_uzawa
#define SAMG3_SET_NCOLOR_BLOCK_GS samg3_set_ncolor_block_gs
#define SAMG3_GET_NCOLOR_BLOCK_GS samg3_get_ncolor_block_gs
#define SAMG3_SET_NCOLOR_BLOCK_GS_MSG samg3_set_ncolor_block_gs_msg
#define SAMG3_GET_NCOLOR_BLOCK_GS_MSG samg3_get_ncolor_block_gs_msg
#define SAMG3_SET_NCOLOR_BLOCK_GS_RESCHK samg3_set_ncolor_block_gs_reschk
#define SAMG3_GET_NCOLOR_BLOCK_GS_RESCHK samg3_get_ncolor_block_gs_reschk
#define SAMG3_SET_NDEGREE_CHEBY samg3_set_ndegree_cheby
#define SAMG3_GET_NDEGREE_CHEBY samg3_get_ndegree_cheby
#define SAMG3_SET_NCFRAMES samg3_set_ncframes
#define SAMG3_GET_NCFRAMES samg3_get_ncframes
#define SAMG3_SET_NCG samg3_set_ncg
#define SAMG3_GET_NCG samg3_get_ncg
#define SAMG3_SET_NCGRAD_DEFAULT samg3_set_ncgrad_default
#define SAMG3_GET_NCGRAD_DEFAULT samg3_get_ncgrad_default
#define SAMG3_SET_NCYC_DEFAULT samg3_set_ncyc_default
#define SAMG3_GET_NCYC_DEFAULT samg3_get_ncyc_default
#define SAMG3_SET_NCYC_MIN samg3_set_ncyc_min
#define SAMG3_GET_NCYC_MIN samg3_get_ncyc_min
#define SAMG3_SET_NCYC_2ND samg3_set_ncyc_2nd
#define SAMG3_GET_NCYC_2ND samg3_get_ncyc_2nd
#define SAMG3_SET_NCYC_START samg3_set_ncyc_start
#define SAMG3_GET_NCYC_START samg3_get_ncyc_start
#define SAMG3_SET_NDYN_SMO samg3_set_ndyn_smo
#define SAMG3_GET_NDYN_SMO samg3_get_ndyn_smo
#define SAMG3_SET_NEG_DIAG samg3_set_neg_diag
#define SAMG3_GET_NEG_DIAG samg3_get_neg_diag
#define SAMG3_SET_NEG_DIAG_BRUTE samg3_set_neg_diag_brute
#define SAMG3_GET_NEG_DIAG_BRUTE samg3_get_neg_diag_brute
#define SAMG3_SET_NEW_ENTRIES samg3_set_new_entries
#define SAMG3_GET_NEW_ENTRIES samg3_get_new_entries
#define SAMG3_SET_NEW_TOPOLOGY samg3_set_new_topology
#define SAMG3_GET_NEW_TOPOLOGY samg3_get_new_topology
#define SAMG3_SET_NILU_REORDER samg3_set_nilu_reorder
#define SAMG3_GET_NILU_REORDER samg3_get_nilu_reorder
#define SAMG3_SET_NINCR_RES_ACCEPTED_MG samg3_set_nincr_res_accepted_mg
#define SAMG3_GET_NINCR_RES_ACCEPTED_MG samg3_get_nincr_res_accepted_mg
#define SAMG3_SET_NINCR_RES_ACCEPTED_1G samg3_set_nincr_res_accepted_1g
#define SAMG3_GET_NINCR_RES_ACCEPTED_1G samg3_get_nincr_res_accepted_1g
#define SAMG3_SET_NINT_ROWSUM1 samg3_set_nint_rowsum1
#define SAMG3_GET_NINT_ROWSUM1 samg3_get_nint_rowsum1
#define SAMG3_SET_NINTER_OMP samg3_set_ninter_omp
#define SAMG3_GET_NINTER_OMP samg3_get_ninter_omp
#define SAMG3_SET_NITER_SKIP samg3_set_niter_skip
#define SAMG3_GET_NITER_SKIP samg3_get_niter_skip
#define SAMG3_SET_NKCYCLE samg3_set_nkcycle
#define SAMG3_GET_NKCYCLE samg3_get_nkcycle
#define SAMG3_SET_NKDIM_DEFAULT samg3_set_nkdim_default
#define SAMG3_GET_NKDIM_DEFAULT samg3_get_nkdim_default
#define SAMG3_SET_NSMOOTH_COO_POLY samg3_set_nsmooth_coo_poly
#define SAMG3_GET_NSMOOTH_COO_POLY samg3_get_nsmooth_coo_poly
#define SAMG3_SET_NSMOAGG samg3_set_nsmoagg
#define SAMG3_GET_NSMOAGG samg3_get_nsmoagg
#define SAMG3_SET_NSMOAGG1LEV samg3_set_nsmoagg1lev
#define SAMG3_GET_NSMOAGG1LEV samg3_get_nsmoagg1lev
#define SAMG3_SET_NSMOAGGLEV samg3_set_nsmoagglev
#define SAMG3_GET_NSMOAGGLEV samg3_get_nsmoagglev
#define SAMG3_SET_NMIN_MATRIX samg3_set_nmin_matrix
#define SAMG3_GET_NMIN_MATRIX samg3_get_nmin_matrix
#define SAMG3_SET_NMIN_MATRIX_RESC samg3_set_nmin_matrix_resc
#define SAMG3_GET_NMIN_MATRIX_RESC samg3_get_nmin_matrix_resc
#define SAMG3_SET_NMIN_VECTOR samg3_set_nmin_vector
#define SAMG3_GET_NMIN_VECTOR samg3_get_nmin_vector
#define SAMG3_SET_NOTALLUNS_CHEAP samg3_set_notalluns_cheap
#define SAMG3_GET_NOTALLUNS_CHEAP samg3_get_notalluns_cheap
#define SAMG3_SET_NP_MOD1 samg3_set_np_mod1
#define SAMG3_GET_NP_MOD1 samg3_get_np_mod1
#define SAMG3_SET_NP_MOD2 samg3_set_np_mod2
#define SAMG3_GET_NP_MOD2 samg3_get_np_mod2
#define SAMG3_SET_NP_OPT samg3_set_np_opt
#define SAMG3_GET_NP_OPT samg3_get_np_opt
#define SAMG3_SET_NPRIM_AT_ALLPNTS samg3_set_nprim_at_allpnts
#define SAMG3_GET_NPRIM_AT_ALLPNTS samg3_get_nprim_at_allpnts
#define SAMG3_SET_NPTMAX samg3_set_nptmax
#define SAMG3_GET_NPTMAX samg3_get_nptmax
#define SAMG3_SET_NPTMN samg3_set_nptmn
#define SAMG3_GET_NPTMN samg3_get_nptmn
#define SAMG3_SET_NRC samg3_set_nrc
#define SAMG3_GET_NRC samg3_get_nrc
#define SAMG3_SET_NRC_EMERGENCY samg3_set_nrc_emergency
#define SAMG3_GET_NRC_EMERGENCY samg3_get_nrc_emergency
#define SAMG3_SET_NRD samg3_set_nrd
#define SAMG3_GET_NRD samg3_get_nrd
#define SAMG3_SET_NRD_2ND samg3_set_nrd_2nd
#define SAMG3_GET_NRD_2ND samg3_get_nrd_2nd
#define SAMG3_SET_NRU samg3_set_nru
#define SAMG3_GET_NRU samg3_get_nru
#define SAMG3_SET_NRU_2ND samg3_set_nru_2nd
#define SAMG3_GET_NRU_2ND samg3_get_nru_2nd
#define SAMG3_SET_NSIMPLE_EMERGENCY samg3_set_nsimple_emergency
#define SAMG3_GET_NSIMPLE_EMERGENCY samg3_get_nsimple_emergency
#define SAMG3_SET_NSOLVE_DEFAULT samg3_set_nsolve_default
#define SAMG3_GET_NSOLVE_DEFAULT samg3_get_nsolve_default
#define SAMG3_SET_NSOLVE_2ND samg3_set_nsolve_2nd
#define SAMG3_GET_NSOLVE_2ND samg3_get_nsolve_2nd
#define SAMG3_SET_NSOLVE_UZAWA samg3_set_nsolve_uzawa
#define SAMG3_GET_NSOLVE_UZAWA samg3_get_nsolve_uzawa
#define SAMG3_SET_NSTAR_TYP samg3_set_nstar_typ
#define SAMG3_GET_NSTAR_TYP samg3_get_nstar_typ
#define SAMG3_SET_NSW_OMEGA_UZAWA samg3_set_nsw_omega_uzawa
#define SAMG3_GET_NSW_OMEGA_UZAWA samg3_get_nsw_omega_uzawa
#define SAMG3_SET_NSW_UZAWA samg3_set_nsw_uzawa
#define SAMG3_GET_NSW_UZAWA samg3_get_nsw_uzawa
#define SAMG3_SET_NTAKE_RES_IN samg3_set_ntake_res_in
#define SAMG3_GET_NTAKE_RES_IN samg3_get_ntake_res_in
#define SAMG3_SET_NTH_RES_SCRATCH samg3_set_nth_res_scratch
#define SAMG3_GET_NTH_RES_SCRATCH samg3_get_nth_res_scratch
#define SAMG3_SET_NTR samg3_set_ntr
#define SAMG3_GET_NTR samg3_get_ntr
#define SAMG3_SET_NTR_PRIM samg3_set_ntr_prim
#define SAMG3_GET_NTR_PRIM samg3_get_ntr_prim
#define SAMG3_SET_NTYP_ACCEL samg3_set_ntyp_accel
#define SAMG3_GET_NTYP_ACCEL samg3_get_ntyp_accel
#define SAMG3_SET_NTYP_GALERKIN samg3_set_ntyp_galerkin
#define SAMG3_GET_NTYP_GALERKIN samg3_get_ntyp_galerkin
#define SAMG3_SET_NUMTRY_MAX_SET samg3_set_numtry_max_set
#define SAMG3_GET_NUMTRY_MAX_SET samg3_get_numtry_max_set
#define SAMG3_SET_NVERSION samg3_set_nversion
#define SAMG3_GET_NVERSION samg3_get_nversion
#define SAMG3_SET_NWT samg3_set_nwt
#define SAMG3_GET_NWT samg3_get_nwt
#define SAMG3_SET_NXTYP_COARSE samg3_set_nxtyp_coarse
#define SAMG3_GET_NXTYP_COARSE samg3_get_nxtyp_coarse
#define SAMG3_SET_OIL_ACCEL samg3_set_oil_accel
#define SAMG3_GET_OIL_ACCEL samg3_get_oil_accel
#define SAMG3_SET_OIL_GPRS samg3_set_oil_gprs
#define SAMG3_GET_OIL_GPRS samg3_get_oil_gprs
#define SAMG3_SET_OIL_NOPRIM samg3_set_oil_noprim
#define SAMG3_GET_OIL_NOPRIM samg3_get_oil_noprim
#define SAMG3_SET_OMEGA_JAC_ES_UZAWA samg3_set_omega_jac_es_uzawa
#define SAMG3_GET_OMEGA_JAC_ES_UZAWA samg3_get_omega_jac_es_uzawa
#define SAMG3_SET_OMEGA_JAC_P_UZAWA samg3_set_omega_jac_p_uzawa
#define SAMG3_GET_OMEGA_JAC_P_UZAWA samg3_get_omega_jac_p_uzawa
#define SAMG3_SET_OMEGA_JACOBI samg3_set_omega_jacobi
#define SAMG3_GET_OMEGA_JACOBI samg3_get_omega_jacobi
#define SAMG3_SET_OMEGA_SOR_DO samg3_set_omega_sor_do
#define SAMG3_GET_OMEGA_SOR_DO samg3_get_omega_sor_do
#define SAMG3_SET_OMEGA_SOR_UP samg3_set_omega_sor_up
#define SAMG3_GET_OMEGA_SOR_UP samg3_get_omega_sor_up
#define SAMG3_SET_OMEGA_SMO samg3_set_omega_smo
#define SAMG3_GET_OMEGA_SMO samg3_get_omega_smo
#define SAMG3_SET_OMEGA_SMO_MIN samg3_set_omega_smo_min
#define SAMG3_GET_OMEGA_SMO_MIN samg3_get_omega_smo_min
#define SAMG3_SET_OMEGA_UZAWA samg3_set_omega_uzawa
#define SAMG3_GET_OMEGA_UZAWA samg3_get_omega_uzawa
#define SAMG3_SET_OMP_ILU samg3_set_omp_ilu
#define SAMG3_GET_OMP_ILU samg3_get_omp_ilu
#define SAMG3_ISET_OMP_PARTITION_FILE samg3_iset_omp_partition_file
#define SAMG3_IGET_OMP_PARTITION_FILE samg3_iget_omp_partition_file
#define SAMG3_SET_OMP_PARTITION_FILE samg3_set_omp_partition_file
#define SAMG3_GET_OMP_PARTITION_FILE samg3_get_omp_partition_file
#define SAMG3_SET_OMP_NUM_THREADS_EXTERNAL samg3_set_omp_num_threads_external
#define SAMG3_GET_OMP_NUM_THREADS_EXTERNAL samg3_get_omp_num_threads_external
#define SAMG3_SET_OMP_NTHREADS_ONLY4SPLIT samg3_set_omp_nthreads_only4split
#define SAMG3_GET_OMP_NTHREADS_ONLY4SPLIT samg3_get_omp_nthreads_only4split
#define SAMG3_SET_OMP_UZAWA samg3_set_omp_uzawa
#define SAMG3_GET_OMP_UZAWA samg3_get_omp_uzawa
#define SAMG3_SET_OPT_MATRIX_OPS samg3_set_opt_matrix_ops
#define SAMG3_GET_OPT_MATRIX_OPS samg3_get_opt_matrix_ops
#define SAMG3_SET_P_CMPLX_AGG_DEFAULT samg3_set_p_cmplx_agg_default
#define SAMG3_GET_P_CMPLX_AGG_DEFAULT samg3_get_p_cmplx_agg_default
#define SAMG3_SET_P_CMPLX_DEFAULT samg3_set_p_cmplx_default
#define SAMG3_GET_P_CMPLX_DEFAULT samg3_get_p_cmplx_default
#define SAMG3_SET_PARTIAL_FRAC samg3_set_partial_frac
#define SAMG3_GET_PARTIAL_FRAC samg3_get_partial_frac
#define SAMG3_ISET_PARTITION_FILE samg3_iset_partition_file
#define SAMG3_IGET_PARTITION_FILE samg3_iget_partition_file
#define SAMG3_SET_PARTITION_FILE samg3_set_partition_file
#define SAMG3_GET_PARTITION_FILE samg3_get_partition_file
#define SAMG3_SET_AMG_RENUMBER samg3_set_amg_renumber
#define SAMG3_GET_AMG_RENUMBER samg3_get_amg_renumber
#define SAMG3_ISET_AMG_RENUMBER_FILE samg3_iset_amg_renumber_file
#define SAMG3_IGET_AMG_RENUMBER_FILE samg3_iget_amg_renumber_file
#define SAMG3_SET_AMG_RENUMBER_FILE samg3_set_amg_renumber_file
#define SAMG3_GET_AMG_RENUMBER_FILE samg3_get_amg_renumber_file
#define SAMG3_ISET_DUMPFILE_RENUMBER samg3_iset_dumpfile_renumber
#define SAMG3_IGET_DUMPFILE_RENUMBER samg3_iget_dumpfile_renumber
#define SAMG3_SET_DUMPFILE_RENUMBER samg3_set_dumpfile_renumber
#define SAMG3_GET_DUMPFILE_RENUMBER samg3_get_dumpfile_renumber
#define SAMG3_SET_PERF_METER_ENABLED samg3_set_perf_meter_enabled
#define SAMG3_GET_PERF_METER_ENABLED samg3_get_perf_meter_enabled
#define SAMG3_SET_PRIM_NORM samg3_set_prim_norm
#define SAMG3_GET_PRIM_NORM samg3_get_prim_norm
#define SAMG3_SET_PRIM_PRINT samg3_set_prim_print
#define SAMG3_GET_PRIM_PRINT samg3_get_prim_print
#define SAMG3_SET_PRINT_NXTYP_COARSE_MSG samg3_set_print_nxtyp_coarse_msg
#define SAMG3_GET_PRINT_NXTYP_COARSE_MSG samg3_get_print_nxtyp_coarse_msg
#define SAMG3_SET_PRINT_SETUP_ILU_OR_DIRECT samg3_set_print_setup_ilu_or_direct
#define SAMG3_GET_PRINT_SETUP_ILU_OR_DIRECT samg3_get_print_setup_ilu_or_direct
#define SAMG3_SET_PRNT_STAT_SCHWARZ samg3_set_prnt_stat_schwarz
#define SAMG3_GET_PRNT_STAT_SCHWARZ samg3_get_prnt_stat_schwarz
#define SAMG3_SET_QUASI_ONLY samg3_set_quasi_only
#define SAMG3_GET_QUASI_ONLY samg3_get_quasi_only
#define SAMG3_SET_REDUCT_KCYCLE samg3_set_reduct_kcycle
#define SAMG3_GET_REDUCT_KCYCLE samg3_get_reduct_kcycle
#define SAMG3_SET_RBM_INTERN_INFO samg3_set_rbm_intern_info
#define SAMG3_GET_RBM_INTERN_INFO samg3_get_rbm_intern_info
#define SAMG3_SET_RCONDX samg3_set_rcondx
#define SAMG3_GET_RCONDX samg3_get_rcondx
#define SAMG3_SET_READ_UZAWA_PARMS samg3_set_read_uzawa_parms
#define SAMG3_GET_READ_UZAWA_PARMS samg3_get_read_uzawa_parms
#define SAMG3_SET_READ_MARIAN_COARSENING samg3_set_read_marian_coarsening
#define SAMG3_GET_READ_MARIAN_COARSENING samg3_get_read_marian_coarsening
#define SAMG3_SET_REFRESH_CALLED samg3_set_refresh_called
#define SAMG3_GET_REFRESH_CALLED samg3_get_refresh_called
#define SAMG3_SET_REL_APP_VAR samg3_set_rel_app_var
#define SAMG3_GET_REL_APP_VAR samg3_get_rel_app_var
#define SAMG3_SET_RHO_MIN samg3_set_rho_min
#define SAMG3_GET_RHO_MIN samg3_get_rho_min
#define SAMG3_SET_RHO_OK samg3_set_rho_ok
#define SAMG3_GET_RHO_OK samg3_get_rho_ok
#define SAMG3_SET_SHOW_UN_RES samg3_set_show_un_res
#define SAMG3_GET_SHOW_UN_RES samg3_get_show_un_res
#define SAMG3_ISET_SCRATCHFILE samg3_iset_scratchfile
#define SAMG3_IGET_SCRATCHFILE samg3_iget_scratchfile
#define SAMG3_SET_SCRATCHFILE samg3_set_scratchfile
#define SAMG3_GET_SCRATCHFILE samg3_get_scratchfile
#define SAMG3_SET_SLOW_COARSENING samg3_set_slow_coarsening
#define SAMG3_GET_SLOW_COARSENING samg3_get_slow_coarsening
#define SAMG3_SET_STABILITY samg3_set_stability
#define SAMG3_GET_STABILITY samg3_get_stability
#define SAMG3_SET_STRUCT_IDENT samg3_set_struct_ident
#define SAMG3_GET_STRUCT_IDENT samg3_get_struct_ident
#define SAMG3_SET_STRUCT_SYMM samg3_set_struct_symm
#define SAMG3_GET_STRUCT_SYMM samg3_get_struct_symm
#define SAMG3_SET_TAU_UZAWA samg3_set_tau_uzawa
#define SAMG3_GET_TAU_UZAWA samg3_get_tau_uzawa
#define SAMG3_SET_TERM_COARSENING samg3_set_term_coarsening
#define SAMG3_GET_TERM_COARSENING samg3_get_term_coarsening
#define SAMG3_SET_TRACE_L2_QUASI_RES samg3_set_trace_l2_quasi_res
#define SAMG3_GET_TRACE_L2_QUASI_RES samg3_get_trace_l2_quasi_res
#define SAMG3_SET_TRACKMEM samg3_set_trackmem
#define SAMG3_GET_TRACKMEM samg3_get_trackmem
#define SAMG3_SET_TRACKRESID samg3_set_trackresid
#define SAMG3_GET_TRACKRESID samg3_get_trackresid
#define SAMG3_SET_TRACK_AP_P samg3_set_track_ap_p
#define SAMG3_GET_TRACK_AP_P samg3_get_track_ap_p
#define SAMG3_SET_USE_IC samg3_set_use_ic
#define SAMG3_GET_USE_IC samg3_get_use_ic
#define SAMG3_SET_VIO_DD samg3_set_vio_dd
#define SAMG3_GET_VIO_DD samg3_get_vio_dd
#define SAMG3_SET_W_AVRGE_AGG_DEFAULT samg3_set_w_avrge_agg_default
#define SAMG3_GET_W_AVRGE_AGG_DEFAULT samg3_get_w_avrge_agg_default
#define SAMG3_SET_W_AVRGE_DEFAULT samg3_set_w_avrge_default
#define SAMG3_GET_W_AVRGE_DEFAULT samg3_get_w_avrge_default
#define SAMG3_SET_WCOUPLED samg3_set_wcoupled
#define SAMG3_GET_WCOUPLED samg3_get_wcoupled
#define SAMG3_SET_WFT samg3_set_wft
#define SAMG3_GET_WFT samg3_get_wft
#define SAMG3_SET_WLEN_SWITCHES_GALERKIN samg3_set_wlen_switches_galerkin
#define SAMG3_GET_WLEN_SWITCHES_GALERKIN samg3_get_wlen_switches_galerkin
#define SAMG3_SET_WRITE_CLUSTER_ID samg3_set_write_cluster_id
#define SAMG3_GET_WRITE_CLUSTER_ID samg3_get_write_cluster_id
#define SAMG3_SET_WTSL samg3_set_wtsl
#define SAMG3_GET_WTSL samg3_get_wtsl
#define SAMG3_RELEASE_INFO samg3_release_info
#define SAMG3_VERSION_INFO samg3_version_info
#define SAMG3_DETAILS_INFO samg3_details_info
#endif

