openCSMP/openCSMP/lib/samg/samg3.h
#ifdef SAMG_LCASE_USCORE
#define SAMG3 samg3_
#define SAMG3_CTIME samg3_ctime_
#define SAMG3_CPUTIME samg3_cputime_
#define SAMG3_ELAPSED_TIME samg3_elapsed_time_
#define SAMG3_ALL_ERRORINFO samg3_all_errorinfo_
#define SAMG3_SIMPLE samg3_simple_
#define SAMG3_MAIN samg3_main_
#define SAMG3_LEAVE samg3_leave_
#define SAMG3_REFRESH samg3_refresh_
#define SAMG3_CLEANUP samg3_cleanup_
#define SAMG3_RESET_HIDDEN samg3_reset_hidden_
#define SAMG3_GET_COMPLEXITIES samg3_get_complexities_
#define SAMG3_GET_NFLAG samg3_get_nflag_
#define SAMG3_SET_NFLAG samg3_set_nflag_
#define SAMG3_GET_NFLAGO samg3_get_nflago_
#define SAMG3_SET_NFLAGO samg3_set_nflago_
#define SAMG3_GET_NFLAGP samg3_get_nflagp_
#define SAMG3_SET_NFLAGP samg3_set_nflagp_
#define SAMG3_GET_NFLAGS samg3_get_nflags_
#define SAMG3_SET_NFLAGS samg3_set_nflags_
#define SAMG3_GET_LEVELS_CREATED samg3_get_levels_created_
#define SAMG3_GET_LEVELS_USED samg3_get_levels_used_
#define SAMG3_GET_LEV_SIZES samg3_get_lev_sizes_
#define SAMG3_GET_MEM_ACTIVE samg3_get_mem_active_
#define SAMG3_GET_TIME_AND_MEM samg3_get_time_and_mem_
#define SAMG3_EXTRAPRINT samg3_extraprint_
#define SAMG3_FLUSH samg3_flush_
#define SAMG3_CVEC_ALLOC samg3_cvec_alloc_
#define SAMG3_CVEC_DEALLOC samg3_cvec_dealloc_
#define SAMG3_CVEC_SET samg3_cvec_set_
#define SAMG3_CVEC_GET samg3_cvec_get_
#define SAMG3_PROPOSE_NSYS_ISCALE_IU samg3_propose_nsys_iscale_iu_
#define SAMG3_USED_OMP_THREADS samg3_used_omp_threads_
#define SAMG3_GET_INNERMAX samg3_get_innermax_
#define SAMG3_SET_INNERMAX samg3_set_innermax_
#define SAMG3_DRV_SET_INNERMAX samg3_drv3_set_innermax_
#define SAMG3_GET_NUM_SMOOTH_VECTORS samg3_get_num_smooth_vectors_
#define SAMG3_SMOOTH_VECTOR_INIT samg3_smooth_vector_init_
#define SAMG3_SMOOTH_VECTOR_SET samg3_smooth_vector_set_
#define SAMG3_SMOOTH_VECTOR_GET samg3_smooth_vector_get_
#define SAMG3_GET_NUM_DEFLATION_VECTORS samg3_get_num_deflation_vectors_
#define SAMG3_DEFLATION_VECTOR_INIT samg3_deflation_vector_init_
#define SAMG3_DEFLATION_VECTOR_SET samg3_deflation_vector_set_
#define SAMG3_DEFLATION_VECTOR_GET samg3_deflation_vector_get_
#define SAMG3_USER_CHECK samg3_user_check_
#define SAMG3_USER_SOLVE samg3_user_solve_
#define SAMG3_USER_CLEANUP samg3_user_cleanup_
#define SAMG3_ARRAY_OFFSET samg3_array_offset_
#define SAMG3_PERFINIT samg3_perfinit_
#define SAMG3_PERFOUT samg3_perfout_
#define SAMG3_PARALLEL_LIB samg3_parallel_lib_
#define SAMG3_MEM_INFO samg3_mem_info_
#define SAMG3_LRATIO samg3_lratio_
#define SAMG3_ADDTIME samg3_addtime_
#define SAMG3_COMPTIME samg3_comptime_
#define SAMG3_COPY_GALERKIN samg3_copy_galerkin_
#define SAMG3_OMEGA_JACOBI_ALLOC samg3_omega_jacobi_alloc_
#define SAMG3_OMEGA_JACOBI_DEALLOC samg3_omega_jacobi_dealloc_
#define SAMG3_OMEGA_JACOBI_SET samg3_omega_jacobi_set_
#define SAMG3_CURRENT_RESIDUAL samg3_current_residual_
#define SAMG3_OPEN_LOGFILE samg3_open_logfile_
#define SAMG3_CLOSE_LOGFILE samg3_close_logfile_
#define SAMG3_COO_VEC_SET samg3_coo_vec_set_
#define SAMG3_COO_VEC_ALLOC samg3_coo_vec_alloc_
#define SAMG3_COO_VEC_DEALLOC samg3_coo_vec_dealloc_
#define SAMG3_IDEC samg3_idec_
#define SAMG3_DC samg3_dc_
#define XSAMG3 xsamg3_
#define XSAMG3_DC xsamg3_dc_
#define XSAMG3_START xsamg3_start_
#define XSAMG3_START_LINUX xsamg3_start_linux_
#define XSAMG3_USER_CTRL xsamg3_user_ctrl_
#define XSAMG3_START_IUM xsamg3_start_ium_
#define XSAMG3_START_SOLVER xsamg3_start_solver_
#define XSAMG3_END_SOLVER xsamg3_end_solver_
#define XSAMG3_FINALIZE xsamg3_finalize_
#define XSAMG3_END xsamg3_end_
#define XSAMG3_GET_LOGIO xsamg3_get_logio_
#define XSAMG3_GET_SLAVE_RETURNCODE xsamg3_get_slave_returncode_
#define XSAMG3_PROCESS_INFO xsamg3_process_info_
#define XSAMG3_GET_INTERNAL_TIMER xsamg3_get_internal_timer_
#define XSAMG3_MPI_INIT xsamg3_mpi_init_
#define XSAMG3_MPI_FINALIZE xsamg3_mpi_finalize_
#define XSAMG3_MPI_COMM_RANK xsamg3_mpi_comm_rank_
#define XSAMG3_GET_MPI_COMM_WORLD xsamg3_get_mpi_comm_world_
#define XSAMG3_GET_PARALLEL_RUN xsamg3_get_parallel_run_
#define XSAMG3_IO_SETTINGS xsamg3_io_settings_
#define XSAMG3_IO_SETTINGS2 xsamg3_io_settings2_
#define XSAMG3_LAST_MSG xsamg3_last_msg_
#define XSAMG3_READ_CONFIG xsamg3_read_config_
#define XSAMG3_PRINT_INTERNAL_TIMER xsamg3_print_internal_timer_
#define XSAMG3_ERROR_INFO xsamg3_error_info_
#define XSAMG3_GET_IERR_ON_TAG_STOP xsamg3_get_ierr_on_tag_stop_
#define XSAMG3_CONFIGFILE_MISSING xsamg3_configfile_missing_
#define XSAMG3_LEAVE xsamg3_leave_
#define XSAMG3_CLEANUP xsamg3_cleanup_
#define SAMG3_DUMP_SEQUENCE_RESET samg3_dump_sequence_reset_
#define SAMG3_GET_RESIDUAL_VECTOR_E samg3_get_residual_vector_e_
#define SAMG3_GET_RESIDUAL_VECTOR_V samg3_get_residual_vector_v_
#define SAMG3_RESIDUAL_VECTOR_LEAVE samg3_residual_vector_leave_
#define SAMG3_SET_RESIDUAL_VECTOR_E samg3_set_residual_vector_e_
#define SAMG3_SET_RESIDUAL_VECTOR_V samg3_set_residual_vector_v_
#define SAMG3_SET_RESIDUAL_VECTOR_INIT samg3_set_residual_vector_init_
#define XSAMG3_OIL xsamg3_oil_
#define SAMG3_OIL samg3_oil_
#define SAMG3_SET_RENUMBER_VEC samg3_set_renumber_vec_
#define SAMG3_GET_RENUMBER_VEC samg3_get_renumber_vec_
#define SAMG3_GETRE_NU samg3_getre_nu_
#define SAMG3_GETDBLE_NU samg3_getdble_nu_
#define SAMG3_GETINT_NU samg3_getint_nu_
#define SAMG3_GETTE_NU samg3_gette_nu_
#define SAMG3_GETLO_NU samg3_getlo_nu_
#define SAMG3_GETSPEC_NU samg3_getspec_nu_
#define SAMG3_SET_A_CMPLX_AGG_DEFAULT samg3_set_a_cmplx_agg_default_
#define SAMG3_GET_A_CMPLX_AGG_DEFAULT samg3_get_a_cmplx_agg_default_
#define SAMG3_SET_A_CMPLX_DEFAULT samg3_set_a_cmplx_default_
#define SAMG3_GET_A_CMPLX_DEFAULT samg3_get_a_cmplx_default_
#define SAMG3_SET_ALLOW_FILNAM_IN samg3_set_allow_filnam_in_
#define SAMG3_GET_ALLOW_FILNAM_IN samg3_get_allow_filnam_in_
#define SAMG3_SET_ALLOW_PRIVATE_IN samg3_set_allow_private_in_
#define SAMG3_GET_ALLOW_PRIVATE_IN samg3_get_allow_private_in_
#define SAMG3_SET_ALLOW_ELIM samg3_set_allow_elim_
#define SAMG3_GET_ALLOW_ELIM samg3_get_allow_elim_
#define SAMG3_SET_ALLUNS_AT_ALLPNTS samg3_set_alluns_at_allpnts_
#define SAMG3_GET_ALLUNS_AT_ALLPNTS samg3_get_alluns_at_allpnts_
#define SAMG3_SET_ART_TIME samg3_set_art_time_
#define SAMG3_GET_ART_TIME samg3_get_art_time_
#define SAMG3_SET_ART_TIME_CYC samg3_set_art_time_cyc_
#define SAMG3_GET_ART_TIME_CYC samg3_get_art_time_cyc_
#define SAMG3_SET_ART_TIME_CYC_2ND samg3_set_art_time_cyc_2nd_
#define SAMG3_GET_ART_TIME_CYC_2ND samg3_get_art_time_cyc_2nd_
#define SAMG3_SET_ART_TIME_SETUP samg3_set_art_time_setup_
#define SAMG3_GET_ART_TIME_SETUP samg3_get_art_time_setup_
#define SAMG3_SET_ART_TIME_SETUP_2ND samg3_set_art_time_setup_2nd_
#define SAMG3_GET_ART_TIME_SETUP_2ND samg3_get_art_time_setup_2nd_
#define SAMG3_SET_B_CMPLX samg3_set_b_cmplx_
#define SAMG3_GET_B_CMPLX samg3_get_b_cmplx_
#define SAMG3_SET_B_CMPLX_AGG_DEFAULT samg3_set_b_cmplx_agg_default_
#define SAMG3_GET_B_CMPLX_AGG_DEFAULT samg3_get_b_cmplx_agg_default_
#define SAMG3_SET_B_CMPLX_DEFAULT samg3_set_b_cmplx_default_
#define SAMG3_GET_B_CMPLX_DEFAULT samg3_get_b_cmplx_default_
#define SAMG3_SET_BACKUP samg3_set_backup_
#define SAMG3_GET_BACKUP samg3_get_backup_
#define SAMG3_SET_BLK_FILLEXP samg3_set_blk_fillexp_
#define SAMG3_GET_BLK_FILLEXP samg3_get_blk_fillexp_
#define SAMG3_SET_BLK_STAB samg3_set_blk_stab_
#define SAMG3_GET_BLK_STAB samg3_get_blk_stab_
#define SAMG3_SET_BLOCK_SCALE samg3_set_block_scale_
#define SAMG3_GET_BLOCK_SCALE samg3_get_block_scale_
#define SAMG3_SET_BLOCK_SCALE2 samg3_set_block_scale2_
#define SAMG3_GET_BLOCK_SCALE2 samg3_get_block_scale2_
#define SAMG3_SET_BLOCK_SCALE3 samg3_set_block_scale3_
#define SAMG3_GET_BLOCK_SCALE3 samg3_get_block_scale3_
#define SAMG3_SET_BS_AUTO_SIGN samg3_set_bs_auto_sign_
#define SAMG3_GET_BS_AUTO_SIGN samg3_get_bs_auto_sign_
#define SAMG3_SET_BS_MIN_BLOCK_SIZE samg3_set_bs_min_block_size_
#define SAMG3_GET_BS_MIN_BLOCK_SIZE samg3_get_bs_min_block_size_
#define SAMG3_SET_BS_OMP samg3_set_bs_omp_
#define SAMG3_GET_BS_OMP samg3_get_bs_omp_
#define SAMG3_ISET_BND_PARTITION_FILE samg3_iset_bnd_partition_file_
#define SAMG3_IGET_BND_PARTITION_FILE samg3_iget_bnd_partition_file_
#define SAMG3_SET_BND_PARTITION_FILE samg3_set_bnd_partition_file_
#define SAMG3_GET_BND_PARTITION_FILE samg3_get_bnd_partition_file_
#define SAMG3_SET_CHECK_ALLPNTS samg3_set_check_allpnts_
#define SAMG3_GET_CHECK_ALLPNTS samg3_get_check_allpnts_
#define SAMG3_SET_CHECK_ORDER samg3_set_check_order_
#define SAMG3_GET_CHECK_ORDER samg3_get_check_order_
#define SAMG3_SET_CHECK_BCSR_DUMP samg3_set_check_bcsr_dump_
#define SAMG3_GET_CHECK_BCSR_DUMP samg3_get_check_bcsr_dump_
#define SAMG3_SET_CL_CPL samg3_set_cl_cpl_
#define SAMG3_GET_CL_CPL samg3_get_cl_cpl_
#define SAMG3_SET_CL_ORDER samg3_set_cl_order_
#define SAMG3_GET_CL_ORDER samg3_get_cl_order_
#define SAMG3_SET_CL_OUTRES samg3_set_cl_outres_
#define SAMG3_GET_CL_OUTRES samg3_get_cl_outres_
#define SAMG3_SET_CL_LEVEL_DEP samg3_set_cl_level_dep_
#define SAMG3_GET_CL_LEVEL_DEP samg3_get_cl_level_dep_
#define SAMG3_SET_CL_AUTO_SIZE samg3_set_cl_auto_size_
#define SAMG3_GET_CL_AUTO_SIZE samg3_get_cl_auto_size_
#define SAMG3_SET_CL_PROC_BORDER samg3_set_cl_proc_border_
#define SAMG3_GET_CL_PROC_BORDER samg3_get_cl_proc_border_
#define SAMG3_SET_CL_QUALITY_MEASURE samg3_set_cl_quality_measure_
#define SAMG3_GET_CL_QUALITY_MEASURE samg3_get_cl_quality_measure_
#define SAMG3_SET_CL_GLOBAL_QUALITY samg3_set_cl_global_quality_
#define SAMG3_GET_CL_GLOBAL_QUALITY samg3_get_cl_global_quality_
#define SAMG3_SET_CL_OMP samg3_set_cl_omp_
#define SAMG3_GET_CL_OMP samg3_get_cl_omp_
#define SAMG3_SET_CL_CMK_REORDER samg3_set_cl_cmk_reorder_
#define SAMG3_GET_CL_CMK_REORDER samg3_get_cl_cmk_reorder_
#define SAMG3_SET_CLSOLVER_FINEST samg3_set_clsolver_finest_
#define SAMG3_GET_CLSOLVER_FINEST samg3_get_clsolver_finest_
#define SAMG3_SET_CLDENSE_CTRL samg3_set_cldense_ctrl_
#define SAMG3_GET_CLDENSE_CTRL samg3_get_cldense_ctrl_
#define SAMG3_SET_CONST_INT_GLK samg3_set_const_int_glk_
#define SAMG3_GET_CONST_INT_GLK samg3_get_const_int_glk_
#define SAMG3_SET_CONST_INT_SOL samg3_set_const_int_sol_
#define SAMG3_GET_CONST_INT_SOL samg3_get_const_int_sol_
#define SAMG3_SET_CNTRL_ENFORCE samg3_set_cntrl_enforce_
#define SAMG3_GET_CNTRL_ENFORCE samg3_get_cntrl_enforce_
#define SAMG3_SET_CNTRL_LOGFILE samg3_set_cntrl_logfile_
#define SAMG3_GET_CNTRL_LOGFILE samg3_get_cntrl_logfile_
#define SAMG3_SET_CNTRL_METHOD samg3_set_cntrl_method_
#define SAMG3_GET_CNTRL_METHOD samg3_get_cntrl_method_
#define SAMG3_SET_CNTRL_RELEASE samg3_set_cntrl_release_
#define SAMG3_GET_CNTRL_RELEASE samg3_get_cntrl_release_
#define SAMG3_SET_CNTRL_RES_DIFF samg3_set_cntrl_res_diff_
#define SAMG3_GET_CNTRL_RES_DIFF samg3_get_cntrl_res_diff_
#define SAMG3_SET_CNTRL_RETRY_ITER samg3_set_cntrl_retry_iter_
#define SAMG3_GET_CNTRL_RETRY_ITER samg3_get_cntrl_retry_iter_
#define SAMG3_SET_CNTRL_STEADY samg3_set_cntrl_steady_
#define SAMG3_GET_CNTRL_STEADY samg3_get_cntrl_steady_
#define SAMG3_SET_CONV_STOP samg3_set_conv_stop_
#define SAMG3_GET_CONV_STOP samg3_get_conv_stop_
#define SAMG3_SET_CORRECT_CLUSTER_INFO samg3_set_correct_cluster_info_
#define SAMG3_GET_CORRECT_CLUSTER_INFO samg3_get_correct_cluster_info_
#define SAMG3_SET_CSET_LASTPNT samg3_set_cset_lastpnt_
#define SAMG3_GET_CSET_LASTPNT samg3_get_cset_lastpnt_
#define SAMG3_SET_CSET_LESSVARS samg3_set_cset_lessvars_
#define SAMG3_GET_CSET_LESSVARS samg3_get_cset_lessvars_
#define SAMG3_SET_CSET_LONGROW samg3_set_cset_longrow_
#define SAMG3_GET_CSET_LONGROW samg3_get_cset_longrow_
#define SAMG3_ISET_CSET_READ samg3_iset_cset_read_
#define SAMG3_IGET_CSET_READ samg3_iget_cset_read_
#define SAMG3_SET_CSET_READ samg3_set_cset_read_
#define SAMG3_GET_CSET_READ samg3_get_cset_read_
#define SAMG3_SET_CSET_ZERODIAG samg3_set_cset_zerodiag_
#define SAMG3_GET_CSET_ZERODIAG samg3_get_cset_zerodiag_
#define SAMG3_SET_CSET_UNKNOWN samg3_set_cset_unknown_
#define SAMG3_GET_CSET_UNKNOWN samg3_get_cset_unknown_
#define SAMG3_SET_CSET_UNKNOWN1 samg3_set_cset_unknown1_
#define SAMG3_GET_CSET_UNKNOWN1 samg3_get_cset_unknown1_
#define SAMG3_SET_CSET_UNKNOWN2 samg3_set_cset_unknown2_
#define SAMG3_GET_CSET_UNKNOWN2 samg3_get_cset_unknown2_
#define SAMG3_SET_DELTA_MILU samg3_set_delta_milu_
#define SAMG3_GET_DELTA_MILU samg3_get_delta_milu_
#define SAMG3_SET_DENSX samg3_set_densx_
#define SAMG3_GET_DENSX samg3_get_densx_
#define SAMG3_SET_DIVERGENCE samg3_set_divergence_
#define SAMG3_GET_DIVERGENCE samg3_get_divergence_
#define SAMG3_SET_DIV_STOP_RULE samg3_set_div_stop_rule_
#define SAMG3_GET_DIV_STOP_RULE samg3_get_div_stop_rule_
#define SAMG3_SET_DIV_THRESHOLD samg3_set_div_threshold_
#define SAMG3_GET_DIV_THRESHOLD samg3_get_div_threshold_
#define SAMG3_SET_DROPTOL samg3_set_droptol_
#define SAMG3_GET_DROPTOL samg3_get_droptol_
#define SAMG3_SET_DROPTOL_CL samg3_set_droptol_cl_
#define SAMG3_GET_DROPTOL_CL samg3_get_droptol_cl_
#define SAMG3_SET_DROPTOL_2ND samg3_set_droptol_2nd_
#define SAMG3_GET_DROPTOL_2ND samg3_get_droptol_2nd_
#define SAMG3_SET_DROPTOL_SMO samg3_set_droptol_smo_
#define SAMG3_GET_DROPTOL_SMO samg3_get_droptol_smo_
#define SAMG3_SET_DUMP_APPROX_SOLUTION samg3_set_dump_approx_solution_
#define SAMG3_GET_DUMP_APPROX_SOLUTION samg3_get_dump_approx_solution_
#define SAMG3_SET_DUMP_CORRECTW samg3_set_dump_correctw_
#define SAMG3_GET_DUMP_CORRECTW samg3_get_dump_correctw_
#define SAMG3_SET_DUMP_GENERATED_SMOVEC samg3_set_dump_generated_smovec_
#define SAMG3_GET_DUMP_GENERATED_SMOVEC samg3_get_dump_generated_smovec_
#define SAMG3_SET_ECG samg3_set_ecg_
#define SAMG3_GET_ECG samg3_get_ecg_
#define SAMG3_SET_ECG_DEFAULT samg3_set_ecg_default_
#define SAMG3_GET_ECG_DEFAULT samg3_get_ecg_default_
#define SAMG3_SET_ICHOLESKY samg3_set_icholesky_
#define SAMG3_GET_ICHOLESKY samg3_get_icholesky_
#define SAMG3_SET_ENFORCE_FULLSMO samg3_set_enforce_fullsmo_
#define SAMG3_GET_ENFORCE_FULLSMO samg3_get_enforce_fullsmo_
#define SAMG3_SET_EPS_ABS samg3_set_eps_abs_
#define SAMG3_GET_EPS_ABS samg3_get_eps_abs_
#define SAMG3_SET_EPS_ACCEPT_JAC_UZAWA samg3_set_eps_accept_jac_uzawa_
#define SAMG3_GET_EPS_ACCEPT_JAC_UZAWA samg3_get_eps_accept_jac_uzawa_
#define SAMG3_SET_EPS_CONVERG_JAC_UZAWA samg3_set_eps_converg_jac_uzawa_
#define SAMG3_GET_EPS_CONVERG_JAC_UZAWA samg3_get_eps_converg_jac_uzawa_
#define SAMG3_SET_EPS_DD samg3_set_eps_dd_
#define SAMG3_GET_EPS_DD samg3_get_eps_dd_
#define SAMG3_SET_EPS_DIVERG_JAC_UZAWA samg3_set_eps_diverg_jac_uzawa_
#define SAMG3_GET_EPS_DIVERG_JAC_UZAWA samg3_get_eps_diverg_jac_uzawa_
#define SAMG3_SET_EPS_DIAG samg3_set_eps_diag_
#define SAMG3_GET_EPS_DIAG samg3_get_eps_diag_
#define SAMG3_SET_EPS_LSQ samg3_set_eps_lsq_
#define SAMG3_GET_EPS_LSQ samg3_get_eps_lsq_
#define SAMG3_SET_ETR samg3_set_etr_
#define SAMG3_GET_ETR samg3_get_etr_
#define SAMG3_SET_ETR_DEFAULT samg3_set_etr_default_
#define SAMG3_GET_ETR_DEFAULT samg3_get_etr_default_
#define SAMG3_SET_ETR2_SMO samg3_set_etr2_smo_
#define SAMG3_GET_ETR2_SMO samg3_get_etr2_smo_
#define SAMG3_SET_EWT samg3_set_ewt_
#define SAMG3_GET_EWT samg3_get_ewt_
#define SAMG3_SET_EWT_DEFAULT samg3_set_ewt_default_
#define SAMG3_GET_EWT_DEFAULT samg3_get_ewt_default_
#define SAMG3_SET_FACTOR_APP_VAR samg3_set_factor_app_var_
#define SAMG3_GET_FACTOR_APP_VAR samg3_get_factor_app_var_
#define SAMG3_SET_FACTOR_QUASI_RES samg3_set_factor_quasi_res_
#define SAMG3_GET_FACTOR_QUASI_RES samg3_get_factor_quasi_res_
#define SAMG3_SET_FACTOR_RES_VAR samg3_set_factor_res_var_
#define SAMG3_GET_FACTOR_RES_VAR samg3_get_factor_res_var_
#define SAMG3_SET_FACTOR_MATRIX_SCALE samg3_set_factor_matrix_scale_
#define SAMG3_GET_FACTOR_MATRIX_SCALE samg3_get_factor_matrix_scale_
#define SAMG3_SET_FACTOR_SOL_JAC_UZAWA samg3_set_factor_sol_jac_uzawa_
#define SAMG3_GET_FACTOR_SOL_JAC_UZAWA samg3_get_factor_sol_jac_uzawa_
#define SAMG3_ISET_FILNAM samg3_iset_filnam_
#define SAMG3_IGET_FILNAM samg3_iget_filnam_
#define SAMG3_SET_FILNAM samg3_set_filnam_
#define SAMG3_GET_FILNAM samg3_get_filnam_
#define SAMG3_ISET_FILNAM_DUMPSOL samg3_iset_filnam_dumpsol_
#define SAMG3_IGET_FILNAM_DUMPSOL samg3_iget_filnam_dumpsol_
#define SAMG3_SET_FILNAM_DUMPSOL samg3_set_filnam_dumpsol_
#define SAMG3_GET_FILNAM_DUMPSOL samg3_get_filnam_dumpsol_
#define SAMG3_ISET_FILNAM_DUMP samg3_iset_filnam_dump_
#define SAMG3_IGET_FILNAM_DUMP samg3_iget_filnam_dump_
#define SAMG3_SET_FILNAM_DUMP samg3_set_filnam_dump_
#define SAMG3_GET_FILNAM_DUMP samg3_get_filnam_dump_
#define SAMG3_ISET_FILNAM_UZAWA samg3_iset_filnam_uzawa_
#define SAMG3_IGET_FILNAM_UZAWA samg3_iget_filnam_uzawa_
#define SAMG3_SET_FILNAM_UZAWA samg3_set_filnam_uzawa_
#define SAMG3_GET_FILNAM_UZAWA samg3_get_filnam_uzawa_
#define SAMG3_SET_FLEX_PCG_LITE samg3_set_flex_pcg_lite_
#define SAMG3_GET_FLEX_PCG_LITE samg3_get_flex_pcg_lite_
#define SAMG3_SET_FORCE_ACCEL samg3_set_force_accel_
#define SAMG3_GET_FORCE_ACCEL samg3_get_force_accel_
#define SAMG3_SET_FORCE_ACCEL_2ND samg3_set_force_accel_2nd_
#define SAMG3_GET_FORCE_ACCEL_2ND samg3_get_force_accel_2nd_
#define SAMG3_SET_FULL_PIVOTING samg3_set_full_pivoting_
#define SAMG3_GET_FULL_PIVOTING samg3_get_full_pivoting_
#define SAMG3_SET_FULL_SETUP samg3_set_full_setup_
#define SAMG3_GET_FULL_SETUP samg3_get_full_setup_
#define SAMG3_SET_G_CMPLX_AGG_DEFAULT samg3_set_g_cmplx_agg_default_
#define SAMG3_GET_G_CMPLX_AGG_DEFAULT samg3_get_g_cmplx_agg_default_
#define SAMG3_SET_G_CMPLX_DEFAULT samg3_set_g_cmplx_default_
#define SAMG3_GET_G_CMPLX_DEFAULT samg3_get_g_cmplx_default_
#define SAMG3_SET_GALERKIN_TIMER samg3_set_galerkin_timer_
#define SAMG3_GET_GALERKIN_TIMER samg3_get_galerkin_timer_
#define SAMG3_SET_GLK_MULT_ZEROS samg3_set_glk_mult_zeros_
#define SAMG3_GET_GLK_MULT_ZEROS samg3_get_glk_mult_zeros_
#define SAMG3_SET_GMAX_MULTIPASS samg3_set_gmax_multipass_
#define SAMG3_GET_GMAX_MULTIPASS samg3_get_gmax_multipass_
#define SAMG3_SET_IAGGREGATION_PROFILE samg3_set_iaggregation_profile_
#define SAMG3_GET_IAGGREGATION_PROFILE samg3_get_iaggregation_profile_
#define SAMG3_SET_IAGGREGATION samg3_set_iaggregation_
#define SAMG3_GET_IAGGREGATION samg3_get_iaggregation_
#define SAMG3_SET_IALL_SMO samg3_set_iall_smo_
#define SAMG3_GET_IALL_SMO samg3_get_iall_smo_
#define SAMG3_SET_IAUTO_OMEGA_JACOBI samg3_set_iauto_omega_jacobi_
#define SAMG3_GET_IAUTO_OMEGA_JACOBI samg3_get_iauto_omega_jacobi_
#define SAMG3_SET_IAUTO_OMEGA_SMOAGG samg3_set_iauto_omega_smoagg_
#define SAMG3_GET_IAUTO_OMEGA_SMOAGG samg3_get_iauto_omega_smoagg_
#define SAMG3_SET_IAUTO_STOP samg3_set_iauto_stop_
#define SAMG3_GET_IAUTO_STOP samg3_get_iauto_stop_
#define SAMG3_SET_IDUMP_SEQUENCE_START samg3_set_idump_sequence_start_
#define SAMG3_GET_IDUMP_SEQUENCE_START samg3_get_idump_sequence_start_
#define SAMG3_SET_IDUMP_SEQUENCE_END samg3_set_idump_sequence_end_
#define SAMG3_GET_IDUMP_SEQUENCE_END samg3_get_idump_sequence_end_
#define SAMG3_SET_ISTAB_CG samg3_set_istab_cg_
#define SAMG3_GET_ISTAB_CG samg3_get_istab_cg_
#define SAMG3_SET_IELASTICITY_PROFILE samg3_set_ielasticity_profile_
#define SAMG3_GET_IELASTICITY_PROFILE samg3_get_ielasticity_profile_
#define SAMG3_SET_IELASTICITY samg3_set_ielasticity_
#define SAMG3_GET_IELASTICITY samg3_get_ielasticity_
#define SAMG3_SET_IESTIM_SPECT_RADIUS samg3_set_iestim_spect_radius_
#define SAMG3_GET_IESTIM_SPECT_RADIUS samg3_get_iestim_spect_radius_
#define SAMG3_SET_IESTIM_SMOOTH_NIT samg3_set_iestim_smooth_nit_
#define SAMG3_GET_IESTIM_SMOOTH_NIT samg3_get_iestim_smooth_nit_
#define SAMG3_SET_INIT_RES_TREATMENT samg3_set_init_res_treatment_
#define SAMG3_GET_INIT_RES_TREATMENT samg3_get_init_res_treatment_
#define SAMG3_SET_IPRNT_RES_ACCURACY samg3_set_iprnt_res_accuracy_
#define SAMG3_GET_IPRNT_RES_ACCURACY samg3_get_iprnt_res_accuracy_
#define SAMG3_SET_ISMO2DFL samg3_set_ismo2dfl_
#define SAMG3_GET_ISMO2DFL samg3_get_ismo2dfl_
#define SAMG3_SET_ISMOAGG_AGGRESSIVE samg3_set_ismoagg_aggressive_
#define SAMG3_GET_ISMOAGG_AGGRESSIVE samg3_get_ismoagg_aggressive_
#define SAMG3_SET_ISMOAGG_OVERCORRECTION samg3_set_ismoagg_overcorrection_
#define SAMG3_GET_ISMOAGG_OVERCORRECTION samg3_get_ismoagg_overcorrection_
#define SAMG3_SET_ISMOAGG_OPTIM samg3_set_ismoagg_optim_
#define SAMG3_GET_ISMOAGG_OPTIM samg3_get_ismoagg_optim_
#define SAMG3_SET_ISMOAGG_BLOCK_TYP samg3_set_ismoagg_block_typ_
#define SAMG3_GET_ISMOAGG_BLOCK_TYP samg3_get_ismoagg_block_typ_
#define SAMG3_SET_ISMOAGG_COMPRESSION samg3_set_ismoagg_compression_
#define SAMG3_GET_ISMOAGG_COMPRESSION samg3_get_ismoagg_compression_
#define SAMG3_SET_ISMOAGG_FILTER_TYP samg3_set_ismoagg_filter_typ_
#define SAMG3_GET_ISMOAGG_FILTER_TYP samg3_get_ismoagg_filter_typ_
#define SAMG3_SET_ISMOAGG_SMOOTH_TYP samg3_set_ismoagg_smooth_typ_
#define SAMG3_GET_ISMOAGG_SMOOTH_TYP samg3_get_ismoagg_smooth_typ_
#define SAMG3_SET_ISMOAGG_SMOOTH_NIT samg3_set_ismoagg_smooth_nit_
#define SAMG3_GET_ISMOAGG_SMOOTH_NIT samg3_get_ismoagg_smooth_nit_
#define SAMG3_SET_ISMOAGG_SMOOTH_1LEV samg3_set_ismoagg_smooth_1lev_
#define SAMG3_GET_ISMOAGG_SMOOTH_1LEV samg3_get_ismoagg_smooth_1lev_
#define SAMG3_SET_ISMOAGG_SMOOTH_NLEV samg3_set_ismoagg_smooth_nlev_
#define SAMG3_GET_ISMOAGG_SMOOTH_NLEV samg3_get_ismoagg_smooth_nlev_
#define SAMG3_SET_IB_CMPLX samg3_set_ib_cmplx_
#define SAMG3_GET_IB_CMPLX samg3_get_ib_cmplx_
#define SAMG3_SET_IB_CMPLX_AGG_DEFAULT samg3_set_ib_cmplx_agg_default_
#define SAMG3_GET_IB_CMPLX_AGG_DEFAULT samg3_get_ib_cmplx_agg_default_
#define SAMG3_SET_IB_CMPLX_DEFAULT samg3_set_ib_cmplx_default_
#define SAMG3_GET_IB_CMPLX_DEFAULT samg3_get_ib_cmplx_default_
#define SAMG3_SET_IBGS_PIVOT samg3_set_ibgs_pivot_
#define SAMG3_GET_IBGS_PIVOT samg3_get_ibgs_pivot_
#define SAMG3_SET_ICASE_JAC_UZAWA samg3_set_icase_jac_uzawa_
#define SAMG3_GET_ICASE_JAC_UZAWA samg3_get_icase_jac_uzawa_
#define SAMG3_SET_ISTATISTICS_SMOVEC samg3_set_istatistics_smovec_
#define SAMG3_GET_ISTATISTICS_SMOVEC samg3_get_istatistics_smovec_
#define SAMG3_SET_ICHECK_SMOINT samg3_set_icheck_smoint_
#define SAMG3_GET_ICHECK_SMOINT samg3_get_icheck_smoint_
#define SAMG3_SET_ICOLOR_OMP samg3_set_icolor_omp_
#define SAMG3_GET_ICOLOR_OMP samg3_get_icolor_omp_
#define SAMG3_SET_IORDERED_OMP samg3_set_iordered_omp_
#define SAMG3_GET_IORDERED_OMP samg3_get_iordered_omp_
#define SAMG3_SET_ICRITS samg3_set_icrits_
#define SAMG3_GET_ICRITS samg3_get_icrits_
#define SAMG3_SET_IDTEST_UZAWA samg3_set_idtest_uzawa_
#define SAMG3_GET_IDTEST_UZAWA samg3_get_idtest_uzawa_
#define SAMG3_SET_IHUGE samg3_set_ihuge_
#define SAMG3_GET_IHUGE samg3_get_ihuge_
#define SAMG3_SET_IJAC_UZAWA samg3_set_ijac_uzawa_
#define SAMG3_GET_IJAC_UZAWA samg3_get_ijac_uzawa_
#define SAMG3_SET_ILU4ALLSCHWARZ samg3_set_ilu4allschwarz_
#define SAMG3_GET_ILU4ALLSCHWARZ samg3_get_ilu4allschwarz_
#define SAMG3_SET_ILU_SPEED samg3_set_ilu_speed_
#define SAMG3_GET_ILU_SPEED samg3_get_ilu_speed_
#define SAMG3_SET_IMPLDO_READ_WRITE_LEN samg3_set_impldo_read_write_len_
#define SAMG3_GET_IMPLDO_READ_WRITE_LEN samg3_get_impldo_read_write_len_
#define SAMG3_SET_INFO_KEEPMEM samg3_set_info_keepmem_
#define SAMG3_GET_INFO_KEEPMEM samg3_get_info_keepmem_
#define SAMG3_SET_INNER_ACCEL samg3_set_inner_accel_
#define SAMG3_GET_INNER_ACCEL samg3_get_inner_accel_
#define SAMG3_SET_IODUMP samg3_set_iodump_
#define SAMG3_GET_IODUMP samg3_get_iodump_
#define SAMG3_ISET_IOFILE_OPTA samg3_iset_iofile_opta_
#define SAMG3_IGET_IOFILE_OPTA samg3_iget_iofile_opta_
#define SAMG3_SET_IOFILE_OPTA samg3_set_iofile_opta_
#define SAMG3_GET_IOFILE_OPTA samg3_get_iofile_opta_
#define SAMG3_ISET_IOFORM samg3_iset_ioform_
#define SAMG3_IGET_IOFORM samg3_iget_ioform_
#define SAMG3_SET_IOFORM samg3_set_ioform_
#define SAMG3_GET_IOFORM samg3_get_ioform_
#define SAMG3_SET_IOGRID samg3_set_iogrid_
#define SAMG3_GET_IOGRID samg3_get_iogrid_
#define SAMG3_SET_IOMOVIE samg3_set_iomovie_
#define SAMG3_GET_IOMOVIE samg3_get_iomovie_
#define SAMG3_SET_IOSCRATCH_DEFAULT samg3_set_ioscratch_default_
#define SAMG3_GET_IOSCRATCH_DEFAULT samg3_get_ioscratch_default_
#define SAMG3_SET_IOUNIT_OPTA samg3_set_iounit_opta_
