openCSMP/openCSMP/lib/samg/samg3.h
#define SAMG3_GET_IOUNIT_OPTA samg3_get_iounit_opta_
#define SAMG3_SET_IPASS_MAX_SET samg3_set_ipass_max_set_
#define SAMG3_GET_IPASS_MAX_SET samg3_get_ipass_max_set_
#define SAMG3_SET_IRESTRICTION_OPENMP samg3_set_irestriction_openmp_
#define SAMG3_GET_IRESTRICTION_OPENMP samg3_get_irestriction_openmp_
#define SAMG3_SET_IPRESSURE_UZAWA samg3_set_ipressure_uzawa_
#define SAMG3_GET_IPRESSURE_UZAWA samg3_get_ipressure_uzawa_
#define SAMG3_SET_IPROFILE_GEOMETRIC samg3_set_iprofile_geometric_
#define SAMG3_GET_IPROFILE_GEOMETRIC samg3_get_iprofile_geometric_
#define SAMG3_SET_ISAT_UZAWA samg3_set_isat_uzawa_
#define SAMG3_GET_ISAT_UZAWA samg3_get_isat_uzawa_
#define SAMG3_SET_ISET_VIO_DD samg3_set_iset_vio_dd_
#define SAMG3_GET_ISET_VIO_DD samg3_get_iset_vio_dd_
#define SAMG3_SET_ISSTEP_UZAWA samg3_set_isstep_uzawa_
#define SAMG3_GET_ISSTEP_UZAWA samg3_get_isstep_uzawa_
#define SAMG3_SET_ISTEP1CASE_UZAWA samg3_set_istep1case_uzawa_
#define SAMG3_GET_ISTEP1CASE_UZAWA samg3_get_istep1case_uzawa_
#define SAMG3_SET_ISTEERING samg3_set_isteering_
#define SAMG3_GET_ISTEERING samg3_get_isteering_
#define SAMG3_SET_ISWIT3_USER samg3_set_iswit3_user_
#define SAMG3_GET_ISWIT3_USER samg3_get_iswit3_user_
#define SAMG3_SET_ITER_CHECK samg3_set_iter_check_
#define SAMG3_GET_ITER_CHECK samg3_get_iter_check_
#define SAMG3_SET_ITER_MATRIX_SCALE samg3_set_iter_matrix_scale_
#define SAMG3_GET_ITER_MATRIX_SCALE samg3_get_iter_matrix_scale_
#define SAMG3_SET_ITER_PRE samg3_set_iter_pre_
#define SAMG3_GET_ITER_PRE samg3_get_iter_pre_
#define SAMG3_SET_ITMAX_CONV samg3_set_itmax_conv_
#define SAMG3_GET_ITMAX_CONV samg3_get_itmax_conv_
#define SAMG3_SET_ITRACE_AMGMAIN samg3_set_itrace_amgmain_
#define SAMG3_GET_ITRACE_AMGMAIN samg3_get_itrace_amgmain_
#define SAMG3_SET_ITRACELEVEL samg3_set_itracelevel_
#define SAMG3_GET_ITRACELEVEL samg3_get_itracelevel_
#define SAMG3_SET_ITRACE_CLSOL samg3_set_itrace_clsol_
#define SAMG3_GET_ITRACE_CLSOL samg3_get_itrace_clsol_
#define SAMG3_SET_ITRACE_CLDENSE samg3_set_itrace_cldense_
#define SAMG3_GET_ITRACE_CLDENSE samg3_get_itrace_cldense_
#define SAMG3_SET_ITRACE_DIVSTOP samg3_set_itrace_divstop_
#define SAMG3_GET_ITRACE_DIVSTOP samg3_get_itrace_divstop_
#define SAMG3_SET_ITRACE_JAC_UZAWA samg3_set_itrace_jac_uzawa_
#define SAMG3_GET_ITRACE_JAC_UZAWA samg3_get_itrace_jac_uzawa_
#define SAMG3_SET_ITRACE_MK_REGULAR samg3_set_itrace_mk_regular_
#define SAMG3_GET_ITRACE_MK_REGULAR samg3_get_itrace_mk_regular_
#define SAMG3_SET_ITRACE_MATRIX_MODE samg3_set_itrace_matrix_mode_
#define SAMG3_GET_ITRACE_MATRIX_MODE samg3_get_itrace_matrix_mode_
#define SAMG3_SET_ITRACE_MATRIX_STORAGE samg3_set_itrace_matrix_storage_
#define SAMG3_GET_ITRACE_MATRIX_STORAGE samg3_get_itrace_matrix_storage_
#define SAMG3_SET_ITRACE_SCHWARZ samg3_set_itrace_schwarz_
#define SAMG3_GET_ITRACE_SCHWARZ samg3_get_itrace_schwarz_
#define SAMG3_SET_ITRACE_SMO samg3_set_itrace_smo_
#define SAMG3_GET_ITRACE_SMO samg3_get_itrace_smo_
#define SAMG3_SET_ITRACE_SOL samg3_set_itrace_sol_
#define SAMG3_GET_ITRACE_SOL samg3_get_itrace_sol_
#define SAMG3_SET_ITRACE_SPLIT samg3_set_itrace_split_
#define SAMG3_GET_ITRACE_SPLIT samg3_get_itrace_split_
#define SAMG3_SET_ITRACE_UZAWA samg3_set_itrace_uzawa_
#define SAMG3_GET_ITRACE_UZAWA samg3_get_itrace_uzawa_
#define SAMG3_SET_SMOAGG_NOQR samg3_set_smoagg_noqr_
#define SAMG3_GET_SMOAGG_NOQR samg3_get_smoagg_noqr_
#define SAMG3_SET_STACKTRACE samg3_set_stacktrace_
#define SAMG3_GET_STACKTRACE samg3_get_stacktrace_
#define SAMG3_SET_STORE_PGS_FACTOR samg3_set_store_pgs_factor_
#define SAMG3_GET_STORE_PGS_FACTOR samg3_get_store_pgs_factor_
#define SAMG3_SET_KCYCLE_PROFILE samg3_set_kcycle_profile_
#define SAMG3_GET_KCYCLE_PROFILE samg3_get_kcycle_profile_
#define SAMG3_SET_KEEPMEM samg3_set_keepmem_
#define SAMG3_GET_KEEPMEM samg3_get_keepmem_
#define SAMG3_SET_K_DISABLE_KRYLOV1 samg3_set_k_disable_krylov1_
#define SAMG3_GET_K_DISABLE_KRYLOV1 samg3_get_k_disable_krylov1_
#define SAMG3_SET_K_DYNCYC samg3_set_k_dyncyc_
#define SAMG3_GET_K_DYNCYC samg3_get_k_dyncyc_
#define SAMG3_SET_LASTGRID samg3_set_lastgrid_
#define SAMG3_GET_LASTGRID samg3_get_lastgrid_
#define SAMG3_SET_LEV_COARSENING_TOO_SLOW samg3_set_lev_coarsening_too_slow_
#define SAMG3_GET_LEV_COARSENING_TOO_SLOW samg3_get_lev_coarsening_too_slow_
#define SAMG3_SET_LEVELS_UZAWA samg3_set_levels_uzawa_
#define SAMG3_GET_LEVELS_UZAWA samg3_get_levels_uzawa_
#define SAMG3_SET_LEVELX samg3_set_levelx_
#define SAMG3_GET_LEVELX samg3_get_levelx_
#define SAMG3_SET_LEVELX_2ND samg3_set_levelx_2nd_
#define SAMG3_GET_LEVELX_2ND samg3_get_levelx_2nd_
#define SAMG3_SET_LFIL_CL samg3_set_lfil_cl_
#define SAMG3_GET_LFIL_CL samg3_get_lfil_cl_
#define SAMG3_SET_LFIL_2ND samg3_set_lfil_2nd_
#define SAMG3_GET_LFIL_2ND samg3_get_lfil_2nd_
#define SAMG3_SET_LFIL_SMO samg3_set_lfil_smo_
#define SAMG3_GET_LFIL_SMO samg3_get_lfil_smo_
#define SAMG3_ISET_LOGFILE samg3_iset_logfile_
#define SAMG3_IGET_LOGFILE samg3_iget_logfile_
#define SAMG3_SET_LOGFILE samg3_set_logfile_
#define SAMG3_GET_LOGFILE samg3_get_logfile_
#define SAMG3_SET_LOGIO samg3_set_logio_
#define SAMG3_GET_LOGIO samg3_get_logio_
#define SAMG3_SET_LU_REUSE samg3_set_lu_reuse_
#define SAMG3_GET_LU_REUSE samg3_get_lu_reuse_
#define SAMG3_SET_MATRIX_MODE samg3_set_matrix_mode_
#define SAMG3_GET_MATRIX_MODE samg3_get_matrix_mode_
#define SAMG3_SET_MATRIX_FORMAT samg3_set_matrix_format_
#define SAMG3_GET_MATRIX_FORMAT samg3_get_matrix_format_
#define SAMG3_SET_MATRIX_SCALE_RENORM samg3_set_matrix_scale_renorm_
#define SAMG3_GET_MATRIX_SCALE_RENORM samg3_get_matrix_scale_renorm_
#define SAMG3_SET_MAX_CALLS samg3_set_max_calls_
#define SAMG3_GET_MAX_CALLS samg3_get_max_calls_
#define SAMG3_SET_MAX_CL_SIZE samg3_set_max_cl_size_
#define SAMG3_GET_MAX_CL_SIZE samg3_get_max_cl_size_
#define SAMG3_SET_MAXCORR_CLUSTER samg3_set_maxcorr_cluster_
#define SAMG3_GET_MAXCORR_CLUSTER samg3_get_maxcorr_cluster_
#define SAMG3_SET_MAX_LEVEL samg3_set_max_level_
#define SAMG3_GET_MAX_LEVEL samg3_get_max_level_
#define SAMG3_SET_MAX_NB_LIST_SIZE samg3_set_max_nb_list_size_
#define SAMG3_GET_MAX_NB_LIST_SIZE samg3_get_max_nb_list_size_
#define SAMG3_SET_MAXITER_JAC_UZAWA samg3_set_maxiter_jac_uzawa_
#define SAMG3_GET_MAXITER_JAC_UZAWA samg3_get_maxiter_jac_uzawa_
#define SAMG3_SET_MAXOP_RESTART samg3_set_maxop_restart_
#define SAMG3_GET_MAXOP_RESTART samg3_get_maxop_restart_
#define SAMG3_SET_MAXRETRY_JAC_UZAWA samg3_set_maxretry_jac_uzawa_
#define SAMG3_GET_MAXRETRY_JAC_UZAWA samg3_get_maxretry_jac_uzawa_
#define SAMG3_SET_MILU samg3_set_milu_
#define SAMG3_GET_MILU samg3_get_milu_
#define SAMG3_SET_MIN_CL_SIZE samg3_set_min_cl_size_
#define SAMG3_GET_MIN_CL_SIZE samg3_get_min_cl_size_
#define SAMG3_SET_MIN_MULTI_SIZE samg3_set_min_multi_size_
#define SAMG3_GET_MIN_MULTI_SIZE samg3_get_min_multi_size_
#define SAMG3_SET_MINITER_JAC_UZAWA samg3_set_miniter_jac_uzawa_
#define SAMG3_GET_MINITER_JAC_UZAWA samg3_get_miniter_jac_uzawa_
#define SAMG3_SET_MK_REGULAR samg3_set_mk_regular_
#define SAMG3_GET_MK_REGULAR samg3_get_mk_regular_
#define SAMG3_SET_MODE_CNTRL samg3_set_mode_cntrl_
#define SAMG3_GET_MODE_CNTRL samg3_get_mode_cntrl_
#define SAMG3_SET_MODE_DEBUG samg3_set_mode_debug_
#define SAMG3_GET_MODE_DEBUG samg3_get_mode_debug_
#define SAMG3_SET_MODE_MESS samg3_set_mode_mess_
#define SAMG3_GET_MODE_MESS samg3_get_mode_mess_
#define SAMG3_SET_MODIFY_MAT samg3_set_modify_mat_
#define SAMG3_GET_MODIFY_MAT samg3_get_modify_mat_
#define SAMG3_SET_MODIFY_RESTRICTION samg3_set_modify_restriction_
#define SAMG3_GET_MODIFY_RESTRICTION samg3_get_modify_restriction_
#define SAMG3_SET_MULTIPASS_ALLCOUP samg3_set_multipass_allcoup_
#define SAMG3_GET_MULTIPASS_ALLCOUP samg3_get_multipass_allcoup_
#define SAMG3_SET_NBLK_DEBUG samg3_set_nblk_debug_
#define SAMG3_GET_NBLK_DEBUG samg3_get_nblk_debug_
#define SAMG3_SET_NBLK_MAX samg3_set_nblk_max_
#define SAMG3_GET_NBLK_MAX samg3_get_nblk_max_
#define SAMG3_SET_NBLK_OVERLAP samg3_set_nblk_overlap_
#define SAMG3_GET_NBLK_OVERLAP samg3_get_nblk_overlap_
#define SAMG3_SET_NBLK_RESID samg3_set_nblk_resid_
#define SAMG3_GET_NBLK_RESID samg3_get_nblk_resid_
#define SAMG3_SET_NBLK_SOLVE samg3_set_nblk_solve_
#define SAMG3_GET_NBLK_SOLVE samg3_get_nblk_solve_
#define SAMG3_SET_NBLK_SOLVER samg3_set_nblk_solver_
#define SAMG3_GET_NBLK_SOLVER samg3_get_nblk_solver_
#define SAMG3_SET_NBND_OMEGA samg3_set_nbnd_omega_
#define SAMG3_GET_NBND_OMEGA samg3_get_nbnd_omega_
#define SAMG3_SET_NBND_OMEGA_UZAWA samg3_set_nbnd_omega_uzawa_
#define SAMG3_GET_NBND_OMEGA_UZAWA samg3_get_nbnd_omega_uzawa_
#define SAMG3_SET_NBND_SWEEPS samg3_set_nbnd_sweeps_
#define SAMG3_GET_NBND_SWEEPS samg3_get_nbnd_sweeps_
#define SAMG3_SET_NBND_SWEEPS_UZAWA samg3_set_nbnd_sweeps_uzawa_
#define SAMG3_GET_NBND_SWEEPS_UZAWA samg3_get_nbnd_sweeps_uzawa_
#define SAMG3_SET_NCOLOR_BLOCK_GS samg3_set_ncolor_block_gs_
#define SAMG3_GET_NCOLOR_BLOCK_GS samg3_get_ncolor_block_gs_
#define SAMG3_SET_NCOLOR_BLOCK_GS_MSG samg3_set_ncolor_block_gs_msg_
#define SAMG3_GET_NCOLOR_BLOCK_GS_MSG samg3_get_ncolor_block_gs_msg_
#define SAMG3_SET_NCOLOR_BLOCK_GS_RESCHK samg3_set_ncolor_block_gs_reschk_
#define SAMG3_GET_NCOLOR_BLOCK_GS_RESCHK samg3_get_ncolor_block_gs_reschk_
#define SAMG3_SET_NDEGREE_CHEBY samg3_set_ndegree_cheby_
#define SAMG3_GET_NDEGREE_CHEBY samg3_get_ndegree_cheby_
#define SAMG3_SET_NCFRAMES samg3_set_ncframes_
#define SAMG3_GET_NCFRAMES samg3_get_ncframes_
#define SAMG3_SET_NCG samg3_set_ncg_
#define SAMG3_GET_NCG samg3_get_ncg_
#define SAMG3_SET_NCGRAD_DEFAULT samg3_set_ncgrad_default_
#define SAMG3_GET_NCGRAD_DEFAULT samg3_get_ncgrad_default_
#define SAMG3_SET_NCYC_DEFAULT samg3_set_ncyc_default_
#define SAMG3_GET_NCYC_DEFAULT samg3_get_ncyc_default_
#define SAMG3_SET_NCYC_MIN samg3_set_ncyc_min_
#define SAMG3_GET_NCYC_MIN samg3_get_ncyc_min_
#define SAMG3_SET_NCYC_2ND samg3_set_ncyc_2nd_
#define SAMG3_GET_NCYC_2ND samg3_get_ncyc_2nd_
#define SAMG3_SET_NCYC_START samg3_set_ncyc_start_
#define SAMG3_GET_NCYC_START samg3_get_ncyc_start_
#define SAMG3_SET_NDYN_SMO samg3_set_ndyn_smo_
#define SAMG3_GET_NDYN_SMO samg3_get_ndyn_smo_
#define SAMG3_SET_NEG_DIAG samg3_set_neg_diag_
#define SAMG3_GET_NEG_DIAG samg3_get_neg_diag_
#define SAMG3_SET_NEG_DIAG_BRUTE samg3_set_neg_diag_brute_
#define SAMG3_GET_NEG_DIAG_BRUTE samg3_get_neg_diag_brute_
#define SAMG3_SET_NEW_ENTRIES samg3_set_new_entries_
#define SAMG3_GET_NEW_ENTRIES samg3_get_new_entries_
#define SAMG3_SET_NEW_TOPOLOGY samg3_set_new_topology_
#define SAMG3_GET_NEW_TOPOLOGY samg3_get_new_topology_
#define SAMG3_SET_NILU_REORDER samg3_set_nilu_reorder_
#define SAMG3_GET_NILU_REORDER samg3_get_nilu_reorder_
#define SAMG3_SET_NINCR_RES_ACCEPTED_MG samg3_set_nincr_res_accepted_mg_
#define SAMG3_GET_NINCR_RES_ACCEPTED_MG samg3_get_nincr_res_accepted_mg_
#define SAMG3_SET_NINCR_RES_ACCEPTED_1G samg3_set_nincr_res_accepted_1g_
#define SAMG3_GET_NINCR_RES_ACCEPTED_1G samg3_get_nincr_res_accepted_1g_
#define SAMG3_SET_NINT_ROWSUM1 samg3_set_nint_rowsum1_
#define SAMG3_GET_NINT_ROWSUM1 samg3_get_nint_rowsum1_
#define SAMG3_SET_NINTER_OMP samg3_set_ninter_omp_
#define SAMG3_GET_NINTER_OMP samg3_get_ninter_omp_
#define SAMG3_SET_NITER_SKIP samg3_set_niter_skip_
#define SAMG3_GET_NITER_SKIP samg3_get_niter_skip_
#define SAMG3_SET_NKCYCLE samg3_set_nkcycle_
#define SAMG3_GET_NKCYCLE samg3_get_nkcycle_
#define SAMG3_SET_NKDIM_DEFAULT samg3_set_nkdim_default_
#define SAMG3_GET_NKDIM_DEFAULT samg3_get_nkdim_default_
#define SAMG3_SET_NSMOOTH_COO_POLY samg3_set_nsmooth_coo_poly_
#define SAMG3_GET_NSMOOTH_COO_POLY samg3_get_nsmooth_coo_poly_
#define SAMG3_SET_NSMOAGG samg3_set_nsmoagg_
#define SAMG3_GET_NSMOAGG samg3_get_nsmoagg_
#define SAMG3_SET_NSMOAGG1LEV samg3_set_nsmoagg1lev_
#define SAMG3_GET_NSMOAGG1LEV samg3_get_nsmoagg1lev_
#define SAMG3_SET_NSMOAGGLEV samg3_set_nsmoagglev_
#define SAMG3_GET_NSMOAGGLEV samg3_get_nsmoagglev_
#define SAMG3_SET_NMIN_MATRIX samg3_set_nmin_matrix_
#define SAMG3_GET_NMIN_MATRIX samg3_get_nmin_matrix_
#define SAMG3_SET_NMIN_MATRIX_RESC samg3_set_nmin_matrix_resc_
#define SAMG3_GET_NMIN_MATRIX_RESC samg3_get_nmin_matrix_resc_
#define SAMG3_SET_NMIN_VECTOR samg3_set_nmin_vector_
#define SAMG3_GET_NMIN_VECTOR samg3_get_nmin_vector_
#define SAMG3_SET_NOTALLUNS_CHEAP samg3_set_notalluns_cheap_
#define SAMG3_GET_NOTALLUNS_CHEAP samg3_get_notalluns_cheap_
#define SAMG3_SET_NP_MOD1 samg3_set_np_mod1_
#define SAMG3_GET_NP_MOD1 samg3_get_np_mod1_
#define SAMG3_SET_NP_MOD2 samg3_set_np_mod2_
#define SAMG3_GET_NP_MOD2 samg3_get_np_mod2_
#define SAMG3_SET_NP_OPT samg3_set_np_opt_
#define SAMG3_GET_NP_OPT samg3_get_np_opt_
#define SAMG3_SET_NPRIM_AT_ALLPNTS samg3_set_nprim_at_allpnts_
#define SAMG3_GET_NPRIM_AT_ALLPNTS samg3_get_nprim_at_allpnts_
#define SAMG3_SET_NPTMAX samg3_set_nptmax_
#define SAMG3_GET_NPTMAX samg3_get_nptmax_
#define SAMG3_SET_NPTMN samg3_set_nptmn_
#define SAMG3_GET_NPTMN samg3_get_nptmn_
#define SAMG3_SET_NRC samg3_set_nrc_
#define SAMG3_GET_NRC samg3_get_nrc_
#define SAMG3_SET_NRC_EMERGENCY samg3_set_nrc_emergency_
#define SAMG3_GET_NRC_EMERGENCY samg3_get_nrc_emergency_
#define SAMG3_SET_NRD samg3_set_nrd_
#define SAMG3_GET_NRD samg3_get_nrd_
#define SAMG3_SET_NRD_2ND samg3_set_nrd_2nd_
#define SAMG3_GET_NRD_2ND samg3_get_nrd_2nd_
#define SAMG3_SET_NRU samg3_set_nru_
#define SAMG3_GET_NRU samg3_get_nru_
#define SAMG3_SET_NRU_2ND samg3_set_nru_2nd_
#define SAMG3_GET_NRU_2ND samg3_get_nru_2nd_
#define SAMG3_SET_NSIMPLE_EMERGENCY samg3_set_nsimple_emergency_
#define SAMG3_GET_NSIMPLE_EMERGENCY samg3_get_nsimple_emergency_
#define SAMG3_SET_NSOLVE_DEFAULT samg3_set_nsolve_default_
#define SAMG3_GET_NSOLVE_DEFAULT samg3_get_nsolve_default_
#define SAMG3_SET_NSOLVE_2ND samg3_set_nsolve_2nd_
#define SAMG3_GET_NSOLVE_2ND samg3_get_nsolve_2nd_
#define SAMG3_SET_NSOLVE_UZAWA samg3_set_nsolve_uzawa_
#define SAMG3_GET_NSOLVE_UZAWA samg3_get_nsolve_uzawa_
#define SAMG3_SET_NSTAR_TYP samg3_set_nstar_typ_
#define SAMG3_GET_NSTAR_TYP samg3_get_nstar_typ_
#define SAMG3_SET_NSW_OMEGA_UZAWA samg3_set_nsw_omega_uzawa_
#define SAMG3_GET_NSW_OMEGA_UZAWA samg3_get_nsw_omega_uzawa_
#define SAMG3_SET_NSW_UZAWA samg3_set_nsw_uzawa_
#define SAMG3_GET_NSW_UZAWA samg3_get_nsw_uzawa_
#define SAMG3_SET_NTAKE_RES_IN samg3_set_ntake_res_in_
#define SAMG3_GET_NTAKE_RES_IN samg3_get_ntake_res_in_
#define SAMG3_SET_NTH_RES_SCRATCH samg3_set_nth_res_scratch_
#define SAMG3_GET_NTH_RES_SCRATCH samg3_get_nth_res_scratch_
#define SAMG3_SET_NTR samg3_set_ntr_
#define SAMG3_GET_NTR samg3_get_ntr_
#define SAMG3_SET_NTR_PRIM samg3_set_ntr_prim_
#define SAMG3_GET_NTR_PRIM samg3_get_ntr_prim_
#define SAMG3_SET_NTYP_ACCEL samg3_set_ntyp_accel_
#define SAMG3_GET_NTYP_ACCEL samg3_get_ntyp_accel_
#define SAMG3_SET_NTYP_GALERKIN samg3_set_ntyp_galerkin_
#define SAMG3_GET_NTYP_GALERKIN samg3_get_ntyp_galerkin_
#define SAMG3_SET_NUMTRY_MAX_SET samg3_set_numtry_max_set_
#define SAMG3_GET_NUMTRY_MAX_SET samg3_get_numtry_max_set_
#define SAMG3_SET_NVERSION samg3_set_nversion_
#define SAMG3_GET_NVERSION samg3_get_nversion_
#define SAMG3_SET_NWT samg3_set_nwt_
#define SAMG3_GET_NWT samg3_get_nwt_
#define SAMG3_SET_NXTYP_COARSE samg3_set_nxtyp_coarse_
#define SAMG3_GET_NXTYP_COARSE samg3_get_nxtyp_coarse_
#define SAMG3_SET_OIL_ACCEL samg3_set_oil_accel_
#define SAMG3_GET_OIL_ACCEL samg3_get_oil_accel_
#define SAMG3_SET_OIL_GPRS samg3_set_oil_gprs_
#define SAMG3_GET_OIL_GPRS samg3_get_oil_gprs_
#define SAMG3_SET_OIL_NOPRIM samg3_set_oil_noprim_
#define SAMG3_GET_OIL_NOPRIM samg3_get_oil_noprim_
#define SAMG3_SET_OMEGA_JAC_ES_UZAWA samg3_set_omega_jac_es_uzawa_
#define SAMG3_GET_OMEGA_JAC_ES_UZAWA samg3_get_omega_jac_es_uzawa_
#define SAMG3_SET_OMEGA_JAC_P_UZAWA samg3_set_omega_jac_p_uzawa_
#define SAMG3_GET_OMEGA_JAC_P_UZAWA samg3_get_omega_jac_p_uzawa_
#define SAMG3_SET_OMEGA_JACOBI samg3_set_omega_jacobi_
#define SAMG3_GET_OMEGA_JACOBI samg3_get_omega_jacobi_
#define SAMG3_SET_OMEGA_SOR_DO samg3_set_omega_sor_do_
#define SAMG3_GET_OMEGA_SOR_DO samg3_get_omega_sor_do_
#define SAMG3_SET_OMEGA_SOR_UP samg3_set_omega_sor_up_
#define SAMG3_GET_OMEGA_SOR_UP samg3_get_omega_sor_up_
#define SAMG3_SET_OMEGA_SMO samg3_set_omega_smo_
#define SAMG3_GET_OMEGA_SMO samg3_get_omega_smo_
#define SAMG3_SET_OMEGA_SMO_MIN samg3_set_omega_smo_min_
#define SAMG3_GET_OMEGA_SMO_MIN samg3_get_omega_smo_min_
#define SAMG3_SET_OMEGA_UZAWA samg3_set_omega_uzawa_
#define SAMG3_GET_OMEGA_UZAWA samg3_get_omega_uzawa_
#define SAMG3_SET_OMP_ILU samg3_set_omp_ilu_
#define SAMG3_GET_OMP_ILU samg3_get_omp_ilu_
#define SAMG3_ISET_OMP_PARTITION_FILE samg3_iset_omp_partition_file_
#define SAMG3_IGET_OMP_PARTITION_FILE samg3_iget_omp_partition_file_
#define SAMG3_SET_OMP_PARTITION_FILE samg3_set_omp_partition_file_
#define SAMG3_GET_OMP_PARTITION_FILE samg3_get_omp_partition_file_
#define SAMG3_SET_OMP_NUM_THREADS_EXTERNAL samg3_set_omp_num_threads_external_
#define SAMG3_GET_OMP_NUM_THREADS_EXTERNAL samg3_get_omp_num_threads_external_
#define SAMG3_SET_OMP_NTHREADS_ONLY4SPLIT samg3_set_omp_nthreads_only4split_
#define SAMG3_GET_OMP_NTHREADS_ONLY4SPLIT samg3_get_omp_nthreads_only4split_
#define SAMG3_SET_OMP_UZAWA samg3_set_omp_uzawa_
#define SAMG3_GET_OMP_UZAWA samg3_get_omp_uzawa_
#define SAMG3_SET_OPT_MATRIX_OPS samg3_set_opt_matrix_ops_
#define SAMG3_GET_OPT_MATRIX_OPS samg3_get_opt_matrix_ops_
#define SAMG3_SET_P_CMPLX_AGG_DEFAULT samg3_set_p_cmplx_agg_default_
#define SAMG3_GET_P_CMPLX_AGG_DEFAULT samg3_get_p_cmplx_agg_default_
#define SAMG3_SET_P_CMPLX_DEFAULT samg3_set_p_cmplx_default_
#define SAMG3_GET_P_CMPLX_DEFAULT samg3_get_p_cmplx_default_
#define SAMG3_SET_PARTIAL_FRAC samg3_set_partial_frac_
#define SAMG3_GET_PARTIAL_FRAC samg3_get_partial_frac_
#define SAMG3_ISET_PARTITION_FILE samg3_iset_partition_file_
#define SAMG3_IGET_PARTITION_FILE samg3_iget_partition_file_
#define SAMG3_SET_PARTITION_FILE samg3_set_partition_file_
#define SAMG3_GET_PARTITION_FILE samg3_get_partition_file_
#define SAMG3_SET_AMG_RENUMBER samg3_set_amg_renumber_
#define SAMG3_GET_AMG_RENUMBER samg3_get_amg_renumber_
#define SAMG3_ISET_AMG_RENUMBER_FILE samg3_iset_amg_renumber_file_
#define SAMG3_IGET_AMG_RENUMBER_FILE samg3_iget_amg_renumber_file_
#define SAMG3_SET_AMG_RENUMBER_FILE samg3_set_amg_renumber_file_
#define SAMG3_GET_AMG_RENUMBER_FILE samg3_get_amg_renumber_file_
#define SAMG3_ISET_DUMPFILE_RENUMBER samg3_iset_dumpfile_renumber_
#define SAMG3_IGET_DUMPFILE_RENUMBER samg3_iget_dumpfile_renumber_
#define SAMG3_SET_DUMPFILE_RENUMBER samg3_set_dumpfile_renumber_
#define SAMG3_GET_DUMPFILE_RENUMBER samg3_get_dumpfile_renumber_
#define SAMG3_SET_PERF_METER_ENABLED samg3_set_perf_meter_enabled_
#define SAMG3_GET_PERF_METER_ENABLED samg3_get_perf_meter_enabled_
#define SAMG3_SET_PRIM_NORM samg3_set_prim_norm_
#define SAMG3_GET_PRIM_NORM samg3_get_prim_norm_
#define SAMG3_SET_PRIM_PRINT samg3_set_prim_print_
#define SAMG3_GET_PRIM_PRINT samg3_get_prim_print_
#define SAMG3_SET_PRINT_NXTYP_COARSE_MSG samg3_set_print_nxtyp_coarse_msg_
#define SAMG3_GET_PRINT_NXTYP_COARSE_MSG samg3_get_print_nxtyp_coarse_msg_
#define SAMG3_SET_PRINT_SETUP_ILU_OR_DIRECT samg3_set_print_setup_ilu_or_direct_
#define SAMG3_GET_PRINT_SETUP_ILU_OR_DIRECT samg3_get_print_setup_ilu_or_direct_
#define SAMG3_SET_PRNT_STAT_SCHWARZ samg3_set_prnt_stat_schwarz_
#define SAMG3_GET_PRNT_STAT_SCHWARZ samg3_get_prnt_stat_schwarz_
#define SAMG3_SET_QUASI_ONLY samg3_set_quasi_only_
#define SAMG3_GET_QUASI_ONLY samg3_get_quasi_only_
#define SAMG3_SET_REDUCT_KCYCLE samg3_set_reduct_kcycle_
#define SAMG3_GET_REDUCT_KCYCLE samg3_get_reduct_kcycle_
#define SAMG3_SET_RBM_INTERN_INFO samg3_set_rbm_intern_info_
#define SAMG3_GET_RBM_INTERN_INFO samg3_get_rbm_intern_info_
#define SAMG3_SET_RCONDX samg3_set_rcondx_
#define SAMG3_GET_RCONDX samg3_get_rcondx_
#define SAMG3_SET_READ_UZAWA_PARMS samg3_set_read_uzawa_parms_
#define SAMG3_GET_READ_UZAWA_PARMS samg3_get_read_uzawa_parms_
#define SAMG3_SET_READ_MARIAN_COARSENING samg3_set_read_marian_coarsening_
#define SAMG3_GET_READ_MARIAN_COARSENING samg3_get_read_marian_coarsening_
#define SAMG3_SET_REFRESH_CALLED samg3_set_refresh_called_
#define SAMG3_GET_REFRESH_CALLED samg3_get_refresh_called_
#define SAMG3_SET_REL_APP_VAR samg3_set_rel_app_var_
#define SAMG3_GET_REL_APP_VAR samg3_get_rel_app_var_
#define SAMG3_SET_RHO_MIN samg3_set_rho_min_
#define SAMG3_GET_RHO_MIN samg3_get_rho_min_
#define SAMG3_SET_RHO_OK samg3_set_rho_ok_
#define SAMG3_GET_RHO_OK samg3_get_rho_ok_
#define SAMG3_SET_SHOW_UN_RES samg3_set_show_un_res_
#define SAMG3_GET_SHOW_UN_RES samg3_get_show_un_res_
#define SAMG3_ISET_SCRATCHFILE samg3_iset_scratchfile_
#define SAMG3_IGET_SCRATCHFILE samg3_iget_scratchfile_
#define SAMG3_SET_SCRATCHFILE samg3_set_scratchfile_
#define SAMG3_GET_SCRATCHFILE samg3_get_scratchfile_
#define SAMG3_SET_SLOW_COARSENING samg3_set_slow_coarsening_
#define SAMG3_GET_SLOW_COARSENING samg3_get_slow_coarsening_
#define SAMG3_SET_STABILITY samg3_set_stability_
#define SAMG3_GET_STABILITY samg3_get_stability_
#define SAMG3_SET_STRUCT_IDENT samg3_set_struct_ident_
#define SAMG3_GET_STRUCT_IDENT samg3_get_struct_ident_
#define SAMG3_SET_STRUCT_SYMM samg3_set_struct_symm_
#define SAMG3_GET_STRUCT_SYMM samg3_get_struct_symm_
#define SAMG3_SET_TAU_UZAWA samg3_set_tau_uzawa_
#define SAMG3_GET_TAU_UZAWA samg3_get_tau_uzawa_
#define SAMG3_SET_TERM_COARSENING samg3_set_term_coarsening_
#define SAMG3_GET_TERM_COARSENING samg3_get_term_coarsening_
#define SAMG3_SET_TRACE_L2_QUASI_RES samg3_set_trace_l2_quasi_res_
#define SAMG3_GET_TRACE_L2_QUASI_RES samg3_get_trace_l2_quasi_res_
#define SAMG3_SET_TRACKMEM samg3_set_trackmem_
#define SAMG3_GET_TRACKMEM samg3_get_trackmem_
#define SAMG3_SET_TRACKRESID samg3_set_trackresid_
#define SAMG3_GET_TRACKRESID samg3_get_trackresid_
#define SAMG3_SET_TRACK_AP_P samg3_set_track_ap_p_
#define SAMG3_GET_TRACK_AP_P samg3_get_track_ap_p_
#define SAMG3_SET_USE_IC samg3_set_use_ic_
#define SAMG3_GET_USE_IC samg3_get_use_ic_
#define SAMG3_SET_VIO_DD samg3_set_vio_dd_
#define SAMG3_GET_VIO_DD samg3_get_vio_dd_
#define SAMG3_SET_W_AVRGE_AGG_DEFAULT samg3_set_w_avrge_agg_default_
#define SAMG3_GET_W_AVRGE_AGG_DEFAULT samg3_get_w_avrge_agg_default_
#define SAMG3_SET_W_AVRGE_DEFAULT samg3_set_w_avrge_default_
#define SAMG3_GET_W_AVRGE_DEFAULT samg3_get_w_avrge_default_
#define SAMG3_SET_WCOUPLED samg3_set_wcoupled_
#define SAMG3_GET_WCOUPLED samg3_get_wcoupled_
#define SAMG3_SET_WFT samg3_set_wft_
#define SAMG3_GET_WFT samg3_get_wft_
#define SAMG3_SET_WLEN_SWITCHES_GALERKIN samg3_set_wlen_switches_galerkin_
#define SAMG3_GET_WLEN_SWITCHES_GALERKIN samg3_get_wlen_switches_galerkin_
#define SAMG3_SET_WRITE_CLUSTER_ID samg3_set_write_cluster_id_
#define SAMG3_GET_WRITE_CLUSTER_ID samg3_get_write_cluster_id_
#define SAMG3_SET_WTSL samg3_set_wtsl_
#define SAMG3_GET_WTSL samg3_get_wtsl_
#define SAMG3_RELEASE_INFO samg3_release_info_
#define SAMG3_VERSION_INFO samg3_version_info_
#define SAMG3_DETAILS_INFO samg3_details_info_
#endif

